[
{"asin": "B07S864GPW", "isPrime": "false", "url": "https://www.amazon.com/dp/B07S864GPW", "title": "Shark IQ Robot Self-Empty XL RV1001AE, Robotic Vacuum, IQ Navigation, Home Mapping, Self-Cleaning Brushroll, Wi-Fi Connected, Works with Alexa", "price": 484.0, "category": "Home & Kitchen", "bsr": 514, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["FORGET ABOUT VACUUMING FOR UP TO A MONTH: A bagless, self-emptying base holds up to 30 days of dirt and debris.", "POWERFUL SUCTION: Deep-cleaning power to take on large debris, small debris, and pet hair on carpets & floors.", "NO HAIR WRAP: Self-cleaning brushroll removes pet hair and long hair as it cleans - no more hair wrap.", "PHONE OR VOICE COMMAND: Schedule whole-home cleanings or target specific rooms or areas to clean right now with the SharkClean app or voice control with Amazon Alexa or Google Assistant.", "TOTAL HOME MAPPING + ROOM SELECT: Maps your home and lets you choose which rooms to clean right now.", "ROW-BY-ROW CLEANING: Methodically cleans row by row and then navigates room to room for complete home coverage.", "RECHARGE AND RESUME: The Shark IQ Robot vacuum will return to the dock, recharge, and can pick up where it left off."], "description": "", "hasBuyBox": "true", "soldBy": "Tech & Beyond", "sellers": 39, "totalReviews": 4835, "uuid": "892b32b0-fc5c-49a3-be8c-e5c25cf64839", "image": "https://images-na.ssl-images-amazon.com/images/I/41oBMbWe4eL._AC_.jpg", "variations": {"sizes": [], "colors": ["Works With Alexa"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A10T40VDKH3AJB&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0147WIC7E", "isPrime": "false", "url": "https://www.amazon.com/dp/B0147WIC7E", "title": "Office Chair Ergonomic Desk Chair Mesh Computer Chair Lumbar Support Modern Executive Adjustable Stool Rolling Swivel Chair for Back Pain, Black", "price": 39.0, "category": "Home & Kitchen", "bsr": 569, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["BUILT FOR COMFORT - Our mesh office/computer chair is built for long-lasting comfort. And easily adjusted for height, the locking mechanism keeps the back upright and relieves the stress and pain brought on by other office chairs.", "ERGONOMIC DESIGN - Designed with human-oriented ergonomic construction, users have full mobility whether you're gaming, working on the computer, or meeting in the office.", "BIFIMA QUALITY-CERTIFIED - Our chairs pass all components of the BIFIMA certification, and are a reliable and sturdy option for users weighing up to 250 pounds.", "EASY ASSEMBLY - Our chair comes ready to assemble, with all the hardware and necessary tools. With step-by-step instructions, you'll be set up and ready to game, take on the office in about 10-15 minutes!", "CUSTOMER GUARANTEE - We want all of our customers to feel ready to take on the day from the comfort of our chairs. This chair comes with 90-days warranty, and a 100% satisfaction guarantee, but if you're not satisfied, please contact BestOffice customer service."], "description": "", "hasBuyBox": "true", "soldBy": "BestForLess Store", "sellers": 4, "totalReviews": 20701, "uuid": "0e221831-fb4f-4fed-bae5-52c5a0a4fbf8", "image": "https://images-na.ssl-images-amazon.com/images/I/41t8zBINMoL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Blue", "Green", "Grey", "Orange", "Pink", "Red", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1QHS1XNTA0I67&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07NTVDN2T", "isPrime": "false", "url": "https://www.amazon.com/dp/B07NTVDN2T", "title": "SodaStream Jet Sparkling Water Maker, Bundle, Black", "price": 169.0, "category": "Home & Kitchen", "bsr": 233, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["Make fresh sparkling water at the push of a button.", "Includes: sparkling water maker, (2) 60L Co2 cylinders, (3) 1 liter BPA-free reusable carbonating bottles, and (2) 40 ml zero calorie fruit drops of Raspberry & Mango.", "Energy efficient, powered by Co2 cylinder. Each Co2 cylinder carbonates up to 60 liters of water.", "Visit SodaStream online or call our sparkling water specialists at 1-800-763-2258 to learn more about our products or refilling your Co2 cylinder."], "description": "Turn plain water into sparkling water in seconds. With jet's compact, cordless design you can enjoy fresh seltzer at the press of a button! Designed to fit beautifully into any home or office, The machine features a slim, space saving design, and operates without electricity so you can use it anywhere. Features our BPA-free carbonating bottle for quick and easy carbonation. This kit includes sparkling water maker, (2) 60L CO2 cylinders, (3) 1L classic carbonating bottles and (2) 40ml fruit drops flavors (mango and raspberry) - everything needed to start sparkling today. Just add water!", "hasBuyBox": "false", "soldBy": "Fords Store", "sellers": 5, "totalReviews": 3955, "uuid": "e86eb603-e15f-4918-b423-dc9ca13b3112", "image": "https://images-na.ssl-images-amazon.com/images/I/518W3a1S9TL._AC_.jpg", "variations": {"sizes": ["Bundle", "Kit"], "colors": ["Black", "Silver"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2PHIH5PAWC3IY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B079WCPPQD", "isPrime": "false", "url": "https://www.amazon.com/dp/B079WCPPQD", "title": "BISSELL Crosswave Pet Pro All in One Wet Dry Vacuum Cleaner and Mop for Hard Floors and Area Rugs, 2306A", "price": 429.0, "category": "Home & Kitchen", "bsr": 1573, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Buy Bissell, save pets; Bissell donates up to 10 dollars to the Bissell pet foundation for every pet product purchase, upon activation. Swivel head.", "Vacuums and washes your floors at the same time. Power cord length: 25 feet", "Pet pro 2306A features a multi surface pet brush roll and pet hair strainer for easy multi surface cleaning. Safe for sealed hard floors and area rugs", "Pet pro 2306A includes specialized pet cleaning solution to help eliminate pet odors. Tank capacity - water tank - 28 ounce | Dirt tank - up to 14.5 ounce", "Pet pro multi surface pet brush roll uses an innovative microfiber and nylon brush to mop and pick up dry debris at the same time. Power rating: 4.4 amperes;Cleaning path width: 12 inch"], "description": "", "hasBuyBox": "false", "soldBy": "Frugal Buys CA LLC", "sellers": 3, "totalReviews": 4664, "uuid": "9381c784-fbe7-490f-b202-10bc831177b4", "image": "https://images-na.ssl-images-amazon.com/images/I/31Su4ObrtOL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2OOEF4MUTD6LX&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07PC7MHQ8", "isPrime": "false", "url": "https://www.amazon.com/dp/B07PC7MHQ8", "title": "Keurig K-Duo Coffee Maker, Single Serve and 12-Cup Carafe Drip Coffee Brewer, Compatible with K-Cup Pods and Ground Coffee, Black", "price": 115.0, "category": "Home & Kitchen", "bsr": 473, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["What's in the box: 12-cup glass carafe included with your brewer along with a heating plate to keep coffee hot.", "Brew a cup and a carafe: Use both ground coffee and k-cup pods. Height with handle open-17.63 H inch. Height with drip cover open-18 H inch", "Multiple brew sizes: Brew a 6, 8, 10, or 12-cup carafe and a 6, 8, 10, or 12 ounce cup.", "Compatible with keurig gold tone mesh filter accessory: A reusable coffee filter you can use to brew your perfect carafe (sold separately).", "Large 60 ounce water reservoir: The 60 ounce water reservoir is shared between the single serve and carafe brewing, saving you time and simplifying your morning routine. Removable reservoir makes refilling easy.", "Strong brew: Brew a stronger, more intense single cup. 30 inch cord length", "Programmable carafe auto-brew: Program your coffee maker to automatically brew a carafe upto 24 hours in advance."], "description": "Introducing the K-Duo Single Serve and Carafe Coffee Maker: the perfect brewer for any occasion. This versatile brewer is the best of both worlds, using both K-Cup pods and ground coffee to brew a cup and a carafe of your favorite varieties. The included 12-cup glass carafe and heating plate are perfect for keeping your coffee hot, and the added convenience of the Pause and Pour feature makes serving a snap! No need to wait for the entire carafe to brew - the Keurig K-Duo coffee maker can be paused mid-brew for 20 seconds, so you can pour fresh, hot coffee right away. Or set your preferred brew time up to 24 hours in advance and enjoy a freshly brewed carafe right when you want it with Programmable Carafe Auto Brew. Create your perfect cup and carafe every time with the K-Duo coffee maker. Choose your favorite ground coffee, or choose from hundreds of delicious K-Cup pod varieties of coffee, tea, cocoa, and more. Use the Strong Brew button for a bolder, more intense single cup. With multiple brew sizes, you can make a 6, 8, 10, or 12-cup carafe for large gatherings, as well as a 6, 8, 10, or 12 oz cup just for you. You can brew the perfect amount of fresh, full-flavored coffee whether you're hosting friends or just enjoying a cup - and a moment - to yourself!", "hasBuyBox": "false", "soldBy": "DealStop", "sellers": 32, "totalReviews": 4949, "uuid": "7450379e-cc9a-470c-893a-ed8387bb10b0", "image": "https://images-na.ssl-images-amazon.com/images/I/41h7Iqa0NcL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3JCHGC39OT7LA&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07NTVDN2T", "isPrime": "false", "url": "https://www.amazon.com/dp/B07NTVDN2T", "title": "SodaStream Jet Sparkling Water Maker, Bundle, Black", "price": 169.0, "category": "Home & Kitchen", "bsr": 233, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["Make fresh sparkling water at the push of a button.", "Includes: sparkling water maker, (2) 60L Co2 cylinders, (3) 1 liter BPA-free reusable carbonating bottles, and (2) 40 ml zero calorie fruit drops of Raspberry & Mango.", "Energy efficient, powered by Co2 cylinder. Each Co2 cylinder carbonates up to 60 liters of water.", "Visit SodaStream online or call our sparkling water specialists at 1-800-763-2258 to learn more about our products or refilling your Co2 cylinder."], "description": "", "hasBuyBox": "false", "soldBy": "Fords Store", "sellers": 5, "totalReviews": 3955, "uuid": "316ae3f4-949d-4c13-be19-b1fd2dbc54e7", "image": "https://images-na.ssl-images-amazon.com/images/I/518W3a1S9TL._AC_.jpg", "variations": {"sizes": ["Bundle", "Kit"], "colors": ["Black", "Silver"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2PHIH5PAWC3IY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B019EQ1YS2", "isPrime": "false", "url": "https://www.amazon.com/dp/B019EQ1YS2", "title": "Ninja BL685 Professional Kitchen System 1200-watts with Auto-iQ, Powerful Blending, with 64 oz, Food Processor Bowl, 72 oz. Total Crushing Pitcher, and Single Serve, Black and Silver", "price": 159.99, "category": "Home & Kitchen", "bsr": 2029, "soldByAmazon": "true", "rating": 4.8, "isFba": "true", "aboutBullets": ["Auto-iQ Technology features timed, intelligent blending programs that do the work for you, no guesswork required.", "XL 72 oz. Total Crushing Pitcher pulverizes ice to snow in seconds for creamy frozen drinks and smoothies (64 oz. max liquid capacity).", "Nutri Ninja Pro Extractor Blades break down whole fruits, vegetables, ice, and seeds for Nutrient & Vitamin Extraction. * *Extract a drink containing vitamins and nutrients from whole fruits and vegetables.", "64 oz. Food Processor Bowl provides precision processing to create perfect, smooth consistency for purees, dips, and spreads.", "Nutri Ninja Cups with Spout Lids allow you to take nutritious drinks and smoothies on the go.", "1200 watts of professional performance power", "Includes: 1200-Watt Motor Base, 72 oz. Total Crushing Pitcher, 64 oz. Food Processor Bowl, Dough Blade, (1) 18 oz. Nutri Ninja Cup, (1) 24 oz. Nutri Ninja Cup, (2) Spout Lids, Pro Extractor Blades Assembly, 25-Recipe Inspiration Guide"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 1, "totalReviews": 171, "uuid": "3d9c1e53-a29e-4d61-82c5-e002edf8033b", "image": "https://images-na.ssl-images-amazon.com/images/I/41FOFTFB0jL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B076B5BQ78", "isPrime": "false", "url": "https://www.amazon.com/dp/B076B5BQ78", "title": "Gotham Steel Cookware + Bakeware Set with Nonstick Durable Ceramic Copper Coating - Includes Skillets, Stock Pots, Deep Square Fry Basket, Cookie Sheet and Baking Pans, 20 Piece, Graphite", "price": 199.95, "category": "Home & Kitchen", "bsr": 1106, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Complete kitchen in a box - includes a complete suite of fry pans, stock pots, sauce pans, bakeware pans, steamers and more", "Award winning Ti-Cerama coating ensures the ultimate release - everything just slides right off the pan, No need for oil or butter", "Ultra-durable, scratch-proof & metal utensil safe", "Please note, this product may arrive either the retail packaging or a recyclable eco-friendly box", "Lightweight design makes for a comfortable cooking experience", "Oven safe up to 500deg F, The pots and pans are suitable for all stovetops, except induction", "Dishwasher safe Makes for effortless clean up"], "description": "Gotham Steel 20 Piece All in One Kitchen Cookware + Bakeware Set with Nonstick Durable Ceramic Copper Coating Includes Skillets, Stock Pots, Deep Square Fry Basket, Cookie Sheet and Baking PansComplete kitchen in a box includes a complete suite of fry pans, stock pots, sauce pans, bakeware pans, steamers and more (see below for complete list of contents)Award winning Ti-Cerama coating, derived from ceramic and reinforced with titanium ensures the ultimate release - everything just slides right off the pan, no need for oil or butterUltra-durable, scratch-proof & metal utensil safePlease note, the components of the set may be individually wrapped and placed in a larger box. Lightweight design makes for a comfortable cooking experienceOven safe up to 500deg F, The pots and pans are suitable for all stovetops, except inductionDishwasher safe Makes for effortless clean upStay cool handles are cool to the touchHealthy & toxin free this cookware set is 100% free of PFOA, PFOS, PTFE, lead & cadmium for an , healthy experience10-year Gotham Steel Cookware is built for years of use and backed by a 10 year limited Contents this set includes 8. 5\" fry pan, 10. 25\" skillet with tempered glass lid, 1. 5 quart sauce pan with tempered glass lid, 2. 5 quart sauce pan with lid, 5 quart stock pot with lid, stainless steel steamer rack, 9. 5\" square shallow pan, 9. 5 deep square casserole pan with tempered glass lid, stainless steel frying basket, steamer insert, 12 x 17 XL cookie sheet, 9. 5 x 9. 5 square baking pan, loaf pan, 9. 5 round baking pan, 12 cup standard sized muffin pan", "hasBuyBox": "true", "soldBy": "Emson", "sellers": 25, "totalReviews": 2413, "uuid": "5e12e873-41d6-40ba-99f1-203556bd8488", "image": "https://images-na.ssl-images-amazon.com/images/I/410GiSFKHdL._AC_.jpg", "variations": {"sizes": [], "colors": ["Graphite", "Red", "Turquoise"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1Y9Y0REM2ELLA&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07DP5941K", "isPrime": "false", "url": "https://www.amazon.com/dp/B07DP5941K", "title": "SodaStream Fizzi Sparkling Water Maker Bundle (Black), with CO2, BPA free Bottles, and 0 Calorie Fruit Drops Flavors", "price": 226.0, "category": "Home & Kitchen", "bsr": 883, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["Make fresh sparkling water at the push of a button.", "Includes: sparkling water maker, (2) 60L Co2 cylinders, (3) 1 liter BPA-free reusable carbonating bottles, and (2) 40 ml zero calorie fruit drops of Lime & Orange.", "Energy efficient, powered by Co2 cylinder. Each cylinder carbonates up to 60 liters of water.", "Easy-to-use snap-lock bottle insertion for quick carbonation.", "Compatible with all SodaStream flavors and SodaStream carbonation bottles (BPA free and better for the planet) except the SodaStream glass carafe.", "Visit SodaStream online or call our sparkling water specialists at 1-800-763-2258 to Learn more about our products or refilling your Co2 cylinder."], "description": "", "hasBuyBox": "false", "soldBy": "National Resource Group LLC", "sellers": 6, "totalReviews": 2671, "uuid": "b18a67d2-91d1-4bc4-a463-5ec1a772b348", "image": "https://images-na.ssl-images-amazon.com/images/I/51LuN7izodL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Icy Blue", "Red", "Rose Gold", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3UVEWNRROPA6J&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0763WDSYZ", "isPrime": "false", "url": "https://www.amazon.com/dp/B0763WDSYZ", "title": "Brother Compact Monochrome Laser Printer, HL-L2350DW, Wireless Printing, Duplex Two-Sided Printing, Amazon Dash Replenishment Ready", "price": 204.0, "category": "Home & Kitchen", "bsr": 968, "soldByAmazon": "false", "rating": 4.3, "isFba": "false", "aboutBullets": ["Print more, wait less. Engineered for increased efficiency with class leading print speeds of up to 32 pages per minute1.", "Dynamic features accommodate your evolving needs. The 250-sheet paper capacity helps improve efficiency with less refills and handles letter or legal sized paper.", "Flexible printing. The manual feed slot offers flexible paper handling for a variety of papers and sizes, such as card stock, envelopes, etc. to help you create professional looking documents.", "Printing as mobile as you are. Print wirelessly from your desktop, laptop, smartphone and tablet2.", "Connect your way. Versatile connection options with built-in wireless or connect locally to a single computer via its USB interface."], "description": "", "hasBuyBox": "false", "soldBy": "Tech unLimited", "sellers": 41, "totalReviews": 5102, "uuid": "5424ca62-c5e9-4867-a932-d8b2855153a1", "image": "https://images-na.ssl-images-amazon.com/images/I/4173yfIfWYL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=AGN1IRHA1OD00&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B007F183LK", "isPrime": "false", "url": "https://www.amazon.com/dp/B007F183LK", "title": "Baratza Encore Conical Burr Coffee Grinder", "price": 139.0, "category": "Home & Kitchen", "bsr": 1644, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["SPECIALTY COFFEE ASSOCIATION AWARD WINNING GRINDERS - Baratza grinders are preferred by coffee professionals and backed by Baratza's world class support.", "GO-TO ENTRY LEVEL GRINDER - Baratza's best-selling grinder, with its small footprint, is THE choice for brewing coffee at home. Available in White or Black.", "USER FRIENDLY - A convenient, front-mounted pulse button, plus a simple ON/OFF switch make it easy to grind fresh coffee.", "40 GRIND SETTINGS - Engineered with 40mm commercial-grade conical burrs that help you explore the extensive range of brew methods (espresso, Aeropress, Hario V60, Chemex, French Press, and automatic brewers).", "WARRANTY/QUALITY PARTS - Hardened alloy steel burrs manufactured in Liechtenstein, Europe, plus a powerful DC motor. This combination creates a consistent grind and durability to ensure the longevity users have come to expect from the Baratza brand. The Encore is backed by Baratza's world class support and a 1 year warranty. 2020 Update has exact same trusted functionality with a sleek new exterior."], "description": "", "hasBuyBox": "true", "soldBy": "Gold Label LLC", "sellers": 11, "totalReviews": 5111, "uuid": "3ac7bb21-d668-4f23-93f9-23fc7b4ad36f", "image": "https://images-na.ssl-images-amazon.com/images/I/31SXbFI4YBL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=ALRPFGEN62HZC&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07M8F5P7B", "isPrime": "false", "url": "https://www.amazon.com/dp/B07M8F5P7B", "title": "Dyson V7 Allergy HEPA Cord-Free Stick Vacuum Cleaner, White", "price": 265.99, "category": "Home & Kitchen", "bsr": 3924, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["Cord free. Hassle free. Filtration : Washable lifetime filter. Whole machine HEPA filtration captures allergens and expels cleaner air than the air you breathe", "Up to 30 minutes of continuous suction. Trigger releases instantly. Battery power is only used for cleaning. Ergonomically designed", "Lightweight and versatile, for easy home cleaning. Instant-release trigger means battery power is only used while it's cleaning. Requires charging for 3.5 hours minimum before first use", "Direct drive cleaner head. Up to 6 minutes of fade-free power (in MAX mode). Drives stiff nylon bristles into carpets to capture deep-down dirt", "Powered by the Dyson digital motor V7 and engineered to pick up ground-in dirt and fine dust from hard floors and carpets"], "description": "Dyson V7 Allergy HEPA cordless vacuum cleaner engineered to clean allergens from homes. Comes with extra tools for tougher tasks and powerful suction. The Dyson V7 Motorhead HEPA cord-free vacuum has 75% more brush bar power than the Dyson V6 Cord-Free vacuum. Engineered for all floor types, the Direct-drive cleaner head drives bristles into the carpet to remove ground-in dirt. The Dyson V7 Motorhead HEPA cord-free vacuum quickly transforms to a handheld for quick clean ups, spot cleaning and cleaning difficult places. Cord-free. Hassle-free. Powerful suction. Up to 30 minutes of powerful fade-free suction. Trigger releases instantly. Battery power is only used for cleaning. Whole machine HEPA filtration captures allergens and expels cleaner air than the air you breathe. The Direct-drive cleaner head drives bristles deep into the carpet to remove ground-in dirt. It has 75% more brush bar power than the Dyson V6 Cord-free vacuum. Transforms to a handheld for beyond the floor cleaning. Hygienic dirt ejector empties dust from the bin in a single action. 2 Tier radial cyclones - 15 cyclones, arranged across two tiers, work in parallel to increase airflow and capture fine dust. Max power mode provides up to 6 minutes of higher suction for more difficult tasks. Balanced for cleaning up top, down below and in between. All Dyson cordless vacuums quickly convert to a handheld for quick clean ups, spot cleaning and cleaning difficult places. Convenient docking station stores and charges the machine, and holds additional attachments. So it's always ready to go.", "hasBuyBox": "true", "soldBy": "Virkin International", "sellers": 57, "totalReviews": 583, "uuid": "4430176c-d956-4476-a092-55f66c00c43c", "image": "https://images-na.ssl-images-amazon.com/images/I/319oa61CxoL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2SKIVJRIK5OTX&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01ALYD1WI", "isPrime": "false", "url": "https://www.amazon.com/dp/B01ALYD1WI", "title": "Cuisinart C77WTR-15P Classic Forged Triple Rivet, 15 Piece Set, White", "price": 84.58, "category": "Home & Kitchen", "bsr": 1654, "soldByAmazon": "true", "rating": 4.7, "isFba": "true", "aboutBullets": ["Set Includes: 8\" Chef Knife, 8\" Slicing Knife, 7\" Santoku Knife, 5.5\" Utility Knife, 3.5\" Paring Knife, 2.75\" Bird's Beak Paring Knife, 4.5\" Steak Knives (6), 8\" Sharpening Steel, All-Purpose Household Shears, Wooden Block.", "Superior high-carbon forged stainless steel blade for precision and accuracy", "Durable extra-wide safety bolster for perfect stability and control", "Stainless steel rivets to secure the full-tang blade to the ergonomically designed handle", "Lifetime warranty"], "description": "Cuisinart Classic Forged Triple Rivet Cutlery possesses superior high-carbon stainless steel blades for precision and accuracy. Packaged in a 15-piece block set and open stock, these extraordinary knives have tapered ground blades that narrow gradually to an extremely sharp, fine edge. Constructed for perfect stability and control, the knives are designed with an extra-wide forged safety bolster and stainless steel rivets securing the blade to the comfortable handle.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 2, "totalReviews": 2167, "uuid": "6d926e63-a761-4ac6-8500-486ee35fb55e", "image": "https://images-na.ssl-images-amazon.com/images/I/41ex0m%2BDSRL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B01BOU6DLE", "isPrime": "false", "url": "https://www.amazon.com/dp/B01BOU6DLE", "title": "Keurig K-Classic Coffee Maker, Single Serve K-Cup Pod Coffee Brewer, 6 to 10 oz. Brew Sizes, Rhubarb", "price": 95.0, "category": "Home & Kitchen", "bsr": 104, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Brews multiple k cup pod sizes: (6, 8, 10 ounce) the most popular k cup pod brew sizes; use the 6 ounce brew size to achieve the strongest brew", "Large 48 ounce water reservoir: Allows you to brew 6+ cups before having to refill, saving you time and simplifying your morning routine; The water reservoir is removable, making it easy to refill whenever you need to", "Descaling: An important part of cleaning your keurig brewer; this process helps to remove calcium deposits, or scale, that can build up inside a coffee maker over time", "Auto off: An auto off feature is easily programmed to turn off your coffee maker after it has been idle for two hours, helping to save energy. Removable Drip Tray", "Simple button controls: Just insert a pod, select your desired cup brew size, and brew a great tasting cup in under a minute"], "description": "The Classic Keurig K-Cup Single Serve Coffee Maker, and a perennial best-seller, the Keurig K-Classic brews a rich, smooth, and delicious cup every time with the quality you expect from Keurig. Simple touch buttons make your brewing experience stress free, and multiple K-Cup pod brew sizes help to ensure you get your perfect cup. Whether you like your coffee strong, mild, decaf, or flavored, you can brew all of your favorites with the Keurig K-Classic andndash; and with large 48oz water reservoir, you can brew 6+ cups before having to refill. Discover hundreds of K-Cup pod varieties from all of the brands you love, including Green Mountain Coffee, Starbucks, and Lipton, and enjoy coffee, tea, hot cocoa and more. Also available in a two fun colors to complement your dandeacute;cor, and compatible with the Keurig Classic Series My K-Cup Reusable Coffee Filter, so you can brew your own ground coffee.", "hasBuyBox": "false", "soldBy": "Meldrum's Discount Market", "sellers": 23, "totalReviews": 36129, "uuid": "e6317970-23b4-46fd-a803-fb3fc88ec8e0", "image": "https://images-na.ssl-images-amazon.com/images/I/415NJOqpkXL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Rhubarb"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=AY7K9MDLTZGY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07H9FMGK4", "isPrime": "false", "url": "https://www.amazon.com/dp/B07H9FMGK4", "title": "Lysol Disinfecting Wipes, Lemon and Lime Blossom, 80ct (Pack of 8)", "price": 106.0, "category": "Home & Kitchen", "bsr": 3029, "soldByAmazon": "false", "rating": 4.8, "isFba": "false", "aboutBullets": [], "description": "", "hasBuyBox": "false", "soldBy": "BrandedEasy", "sellers": 19, "totalReviews": 12, "uuid": "deeffc83-3140-4653-a311-93c099685058", "image": "https://images-na.ssl-images-amazon.com/images/I/41OcNY-sQLL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1WLXDO8WG81GB&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B088C6VTKY", "isPrime": "false", "url": "https://www.amazon.com/dp/B088C6VTKY", "title": "Shark IZ163H Rocket Pet Pro Cordless Stick Vacuum with MultiFlex, Self-Cleaning Brushroll, Dirt Engage Technology and Powerful Suction, in Raspberry", "price": 269.99, "category": "Home & Kitchen", "bsr": 13058, "soldByAmazon": "false", "rating": 4.6, "isFba": "true", "aboutBullets": ["Powerful suction for whole-home cleaning: dirt, debris, pet hair, and tough messes", "Self-cleaning brushroll with Dirt Engage technology allows nonstop removal of long hair and pet hair", "Dirt Engage technology delivers unbeatable cleaning performance on carpets and bare floors compared to all Shark cordless vacuums by removing deeply embedded debris on carpets and by directly engaging bare floors", "MultiFLEX technology allows you to bend the wand to easily reach under furniture and appliances, and store in closet.", "Up to 40 minutes of runtime in Standard mode, measured at the hand vacuum. Removable battery can be charged in or out of the unit", "Anti-Allergen Complete Seal Technology and a HEPA filter trap dust and allergens inside the vacuum cleaner", "What's Included: (1) Shark Rocket Pet Pro Cordless Vacuum with MultiFlex, (1) Crevice Tool, (1) Pet Multi-Tool"], "description": "The Shark Rocket Pet Pro Cordless Vacuum with MultiFlex was designed for homes with pets. It combines powerful suction and a self-cleaning brushroll with Dirt Engage technology to deliver unbeatable cleaning on hard floors and carpets vs. all Shark cordless vacuums with no hair wrap. Its lightweight design and removable handheld vacuum deliver cordless cleaning from floor to ceiling. Plus, the added benefit of MultiFLEX technology to help you easily reach under furniture and appliances.", "hasBuyBox": "true", "soldBy": "DC-Deals", "sellers": 2, "totalReviews": 177, "uuid": "02cd8a20-e3a6-4dbb-a940-78ddc9cc08ea", "image": "https://images-na.ssl-images-amazon.com/images/I/31Dctb8gxBL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2W07MEEDV3M1O&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01N11XJQ6", "isPrime": "false", "url": "https://www.amazon.com/dp/B01N11XJQ6", "title": "Vitamix A3300 Ascent Series Smart Blender, Professional-Grade, 64 oz. Low-Profile Container, Black Diamond", "price": 489.99, "category": "Home & Kitchen", "bsr": 3492, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["You're in control: variable speed control and pulse feature let you manually Fine-tune the texture of any recipe", "Built-in wireless connectivity: The motor base will automatically adjust the maximum blending times for the container size you've chosen. Add a range of compatible container sizes, building a customized blending system designed to fit your needs.", "Programmable timer a built-in digital timer helps avoid over- or under-processing your custom recipes. Set the timer to the length of your blend, and it will turn the machine off automatically.", "Touch interface: touchscreen controls give the machine a sleek silhouette and are easily wiped clean.", "Pair with the Vitamix perfect blend app unlock your blender's full potential with 17 programs and 500+ recipes with the iOS + Android app.", "Low-profile 64-ounce container: perfect for family meals and entertaining, while fitting comfortably under most kitchen cabinets."], "description": "Vitamix fuels passions. It's why wear the brand most trusted by professional chefs. But you won't just find us in restaurant kitchens. You'll also find us in home kitchens around the world. Because whether you're interested in the culinary Arts, making healthier choices, or enjoying restaurant-quality smoothies at home--when you're ready to move on and move up, when you're ready to invest in your passion, you're ready for Vitamin.easy to clean", "hasBuyBox": "true", "soldBy": "RS_Presbyterian", "sellers": 10, "totalReviews": 156, "uuid": "fede0865-1929-45ea-8583-3292cae757b6", "image": "https://images-na.ssl-images-amazon.com/images/I/41JB9ez8RpL._AC_.jpg", "variations": {"sizes": [], "colors": ["BLACK DIAMOND", "Brushed Stainless Finish", "PEARL GRAY"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A205P6RU02858T&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07C44DM6D", "isPrime": "false", "url": "https://www.amazon.com/dp/B07C44DM6D", "title": "Dupray Neat Steam Cleaner Multipurpose Heavy Duty Steamer for Floors, Cars, Home Use and More.", "price": 189.78, "category": "Home & Kitchen", "bsr": 6153, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["STEAM CLEAN. DEGREASE. DEODORIZE. ANY SURFACE. BETTER.", "POWERFUL STEAM CLEANER: up to 275degF/135degC. Best multi purpose steamer for home, cars and more.", "HEAVY-DUTY & LARGE CAPACITY: Up to 50 minutes of cleaning time per fill up.", "PERFECT FOR FLOOR CLEANING: use any regular towel or cloth, no need for expensive special pads!", "WARRANTY: 2 years / Lifetime on steam cleaner boiler."], "description": "", "hasBuyBox": "true", "soldBy": "DUPRAY", "sellers": 2, "totalReviews": 5580, "uuid": "b8e49602-4a19-442d-8a6d-ac7f233273bc", "image": "https://images-na.ssl-images-amazon.com/images/I/51QyHz6WgnL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A3RD7B1JH1Z0GU&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B07FFWFXDD", "isPrime": "false", "url": "https://www.amazon.com/dp/B07FFWFXDD", "title": "INK+IVY Rhea 100% Cotton Comforter, Clipped Jacquard Stripes Modern Luxe All Season Down Alternative Bed Set with Matching Shams, King/Cal King, Ivory/Charcoal 3 Piece", "price": 139.0, "category": "Home & Kitchen", "bsr": 1669, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["100% Cotton", "Made with 100% cotton, this luxurious tufted chenille design, in an all-over geometric pattern, offers a soft texture and dimension to your bed", "A 3-piece 100% cotton percale comforter set with a hidden bartacking for a \"Duvet style\" look.", "Naturally breathable and lightweight cotton fabric paired with hypoallergenic filling for a perfect all season bedding.", "Set includes: 1 comforter: 104\"W x 92\"L, 2 king shams: 20\"W x 36\"L", "Care instructions: Machine washable"], "description": "", "hasBuyBox": "false", "soldBy": "KART IT", "sellers": 4, "totalReviews": 1411, "uuid": "93498ec3-de09-40f3-824a-b732bb4196d9", "image": "https://images-na.ssl-images-amazon.com/images/I/61XqBZJ-0jL._AC_.jpg", "variations": {"sizes": ["Full/Queen(88\"x92\")", "King/Cal King(104\"x92\")"], "colors": ["Ellipse Navy Hexagon", "Imani, Ivory Chenille Tufted Accent", "Nea, Ivory Stripes Tassel Accent", "Rhea, Grey Geometric Clipped Jacquard", "Rhea, Ivory Geometric Clipped Jacquard", "Suri Gray/Blush Stripes"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A14RGF7JMHGJUF&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B01M0AGJIQ", "isPrime": "false", "url": "https://www.amazon.com/dp/B01M0AGJIQ", "title": "Duraflame 3D Infrared Electric Fireplace Stove with Remote Control - Portable Indoor Space Heater - DFI-5010 (Black)", "price": 162.0, "category": "Home & Kitchen", "bsr": 1102, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["5,200 BTU heater provides supplemental zone heating for up to 1,000 square feet to help you save money", "Patent pending 3D flame effect technology features realistic flames that dance on and behind the logs, including five adjustable color, brightness, and speed settings", "The infrared quartz heat helps to maintain the natural humidity in the air, resulting in comfortable heat without drying out the room's", "Overheat protection, heater will instantly shut off to prevent overheating. Volts : 120. Amps : 12.5", "Adjustable, digital thermostat allows you to decide the temperature of your room"], "description": "", "hasBuyBox": "true", "soldBy": "Electric Fireplaces Direct Outlet", "sellers": 5, "totalReviews": 3641, "uuid": "3b125fe0-4efe-46ef-88a1-6ba3982f8242", "image": "https://images-na.ssl-images-amazon.com/images/I/41AJjBcwNJL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Bronze", "Cinnamon", "Cream", "French Grey", "Navy"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A37N9FXRQOLNOD&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07SXD5KKG", "isPrime": "false", "url": "https://www.amazon.com/dp/B07SXD5KKG", "title": "BISSELL, 2554A CrossWave Cordless Max All in One Wet-Dry Vacuum Cleaner and Mop for Hard Floors and Area Rugs, Black/Pearl White with Electric Blue Accents", "price": 277.0, "category": "Home & Kitchen", "bsr": 2405, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["Every Bissell purchase helps save pets. Bissell proudly supports Bissell pet foundation and its mission to help save homeless pets.", "Vacuum and wash your floors at the same time with cordless freedom.", "Up to 30 minutes of cordless cleaning power with a 36V lithium ion battery.", "Improved edge cleaning to easily pick-up pet hair that gathers along baseboards and in corners of your home.", "Multi-surface cleaning means it's safe for use on tile, sealed wood floors, rugs, laminate, linoleum, rubber floor mats, pressed wood floors, and more. It even refreshes area rugs", "Self-cleaning cycle helps maintain machine's cleaning performance. Cleaning path width: 10.5 inch", "Two-tank technology keeps clean water and formula separate from dirty water and dry debris."], "description": "", "hasBuyBox": "false", "soldBy": "Amazon Warehouse", "sellers": 1, "totalReviews": 1891, "uuid": "3133bb54-d2f1-4d19-a13d-9785b5f574b8", "image": "https://images-na.ssl-images-amazon.com/images/I/31f8XxVXvAL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07TXGQS3H", "isPrime": "false", "url": "https://www.amazon.com/dp/B07TXGQS3H", "title": "Roborock S4 Robot Vacuum, Precision Navigation, 2000Pa Strong Suction, Robotic Vacuum Cleaner with Mapping, Ideal for Pet Hair, Low-Pile Carpets & Most Floor Types", "price": 259.0, "category": "Home & Kitchen", "bsr": 11791, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["A high-precision laser navigation system scans your room at 300RPM, creating a real-time map of your home that is accurate to up to +/- 2cm.", "Comprehensive Roborock app control, including map saving, selective cleaning, no-go zones, and power setting, give you total control of S4 no matter where you are.", "Intense 2000pa Suction, enough to lift AA batteries, easily picks dust off floors and can even drag trapped dirt from deep inside low-pile carpets. Do not suggest to use it on high-pile carpets.", "Supersized 5200mAh LiPo battery, good for over 150 minutes of non-stop cleaning, is more than enough to clean most homes in one session.", "An elegant transparent design adds a touch of style, and also makes checking the dustbin easier. A glance through the shell is all you need to do."], "description": "", "hasBuyBox": "false", "soldBy": "", "sellers": 0, "totalReviews": 2067, "uuid": "2568a9fb-890d-484e-93a4-5b99ddf048eb", "image": "https://images-na.ssl-images-amazon.com/images/I/41vEoZYnbnL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2NZXCP1D8DIIH&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": null},
{"asin": "B005EPRF1I", "isPrime": "false", "url": "https://www.amazon.com/dp/B005EPRF1I", "title": "Hamilton Beach 2 Lb Digital Bread Maker, Programmable, 12 Settings + Gluten Free, Dishwasher Safe Pan + 2 Kneading Paddles, Black (29882)", "price": 179.0, "category": "Home & Kitchen", "bsr": 2460, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["12 settings including gluten-free developed with nutrition in mind, settings include: French, quick bread (no yeast), sweet, 1.5-pounds express, 2-pounds express, dough, jam, cake, whole grain and bake audible reminder for adding fruits and nuts", "Choose 1.5 pounds or 2 pounds loaf and crust settings select your loaf size and choose from light, medium or dark crust setting", "Large digital display with delay timer view and select the cycle, crust, and loaf size use delay timer to add ingredients and begin the baking process later -- perfect for breakfast and entertaining", "Non-stick, dishwasher-safe pan & 2 kneading paddles interior pan removes for easy cleaning in the dishwasher two kneading paddles let you use one while the other is in the dishwasher", "3 easy steps: Add ingredients, select cycle and start"], "description": "La maquina para hacer pan Hamilton Beach de 2 lb (907 gramos) te permite crear panes y masas recien hechos en casa sin ni siquiera arremangarte para mezclar y amasar. Con 12 configurations programadas para una variedad de panes y masas, puedes preparer en la maquina de pan casero de to-do desde opciones saludables de granos enteros y sin gluten hasta bollos dulces de canela y pasas en cualquier momento que lo desees.", "hasBuyBox": "false", "soldBy": "Bay Collections", "sellers": 5, "totalReviews": 5734, "uuid": "cfc39f35-5699-4c08-bc47-febd70826b45", "image": "https://images-na.ssl-images-amazon.com/images/I/31jonF%2Bxv8L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A285LGLZZRUZGF&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B079QYYGF1", "isPrime": "false", "url": "https://www.amazon.com/dp/B079QYYGF1", "title": "eufy by Anker, BoostIQ RoboVac 11S (Slim), Robot Vacuum Cleaner, Super-Thin, 1300Pa Strong Suction, Quiet, Self-Charging Robotic Vacuum Cleaner, Cleans Hard Floors to Medium-Pile Carpets", "price": 219.99, "category": "Home & Kitchen", "bsr": 3525, "soldByAmazon": "false", "rating": 4.4, "isFba": "true", "aboutBullets": ["\"Best robot vacuums of 2019\" by Tom's Guide.", "All-New RoboVac: Re-engineered to be the slimmest* RoboVac (2.85'') but with quiet operation and increased suction power at 1300Pa.", "BoostIQ Technology: Automatically increases suction power within 1.5 seconds when extra vacuuming strength is needed to get the best clean.", "A Quiet Clean: Vacuums for up to 100 minutes** on hardwood floors with consistent, powerful suction at a volume no louder than an operating microwave.", "What You Get: RoboVac 11S, remote control (2 AAA batteries included), charging base, AC power adapter, cleaning tool, extra set of high-performance filters, 4 side brushes, 5 cable ties, welcome guide, and our worry-free 12-month warranty."], "description": "", "hasBuyBox": "true", "soldBy": "EufyHome", "sellers": 9, "totalReviews": 29874, "uuid": "b08a2e26-ea0f-4054-afce-62c724c3382d", "image": "https://images-na.ssl-images-amazon.com/images/I/41GgsX2iHkL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1U62USFOR8NN3&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00JBKVN8S", "isPrime": "false", "url": "https://www.amazon.com/dp/B00JBKVN8S", "title": "Brother XM2701 Sewing Machine, Lightweight, Full Featured, 27 Stitches, 6 Included Feet", "price": 209.0, "category": "Home & Kitchen", "bsr": 862, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["27 Unique built-in stitches: The XM2701 includes 27 built-in stitches including decorative, blind hem, zigzag, and stretch stitches and an auto-size buttonhole", "Automatic needle threader and drop-in top bobbin: This sewing machine includes an automatic needle threader that perfectly pushes thread through the needle and a convenient, jam resistant drop-in top bobbin", "Included accessories: The XM2701 comes with 6 sewing feet, 3-piece needle set, twin needle, 4 bobbins, instructional DVD, manual and more", "Versatile free arm: This free arm sewing machine is perfect for a wide range of everyday sewing projects, and users from beginners to advanced", "At your side support: The XM2701 sewing machine comes with Brother At your side support offering free technical support via online, live chat or phone for the life of your machine"], "description": "", "hasBuyBox": "false", "soldBy": "LightingDealShop", "sellers": 3, "totalReviews": 8655, "uuid": "650b1f16-4bda-4ea9-ae67-1021a78ce172", "image": "https://images-na.ssl-images-amazon.com/images/I/41vm1t3NSjL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2048YWNRT8CMB&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07LGDYV3C", "isPrime": "false", "url": "https://www.amazon.com/dp/B07LGDYV3C", "title": "Medify Air MA-40-W V2.0 Air Purifier with H13 HEPA filter - a higher grade of HEPA for 840 Sq. Ft. Air Purifier, 99.9% | Modern Design - White", "price": 270.0, "category": "Home & Kitchen", "bsr": 2280, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["A higher grade of HEPA - H13 Filters (higher rated than True HEPA) 99.9% particle removal.", "Cleans a room up to 1,600 sq ft in one hour, 840 sq ft in 30 minutes, 420 sq ft in 15 minutes (CADR 330)", "To make V2.0 quieter in 'Sleep Mode' and Speed 1 the ionizer is automatically turned off, on speed 2 and 3 it can be turned on/off as needed | CARB, Energy Star & ETL certified.", "Tempered Glass panel (like your cell phone, easy to clean, won't scratch like cheap plastic models), sleep and 3 fan speeds, 8 hr timer, night mode, child lock", "Genuine Medify Replacement Filter: B07MTQFFNT, 110 Volt units, USA registered Lifetime Warranty"], "description": "", "hasBuyBox": "false", "soldBy": "Medify Air", "sellers": 1, "totalReviews": 3773, "uuid": "2681d947-7fa8-4b5d-bc7b-aac89e5baeb6", "image": "https://images-na.ssl-images-amazon.com/images/I/41D2uAfQOpL._AC_.jpg", "variations": {"sizes": ["1-Pack", "2-Pack"], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A32M9WIF92ZF3R&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B01MSZ036Q", "isPrime": "false", "url": "https://www.amazon.com/dp/B01MSZ036Q", "title": "Dyson V7 Motorhead Cordless Stick Vacuum Cleaner, Fuchsia (227591-01)", "price": 297.99, "category": "Home & Kitchen", "bsr": 5864, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Cord free; Hassle free; Powerful suction", "Up to 30 minute's run time when using a non-motorized tool. Detachable battery: Non-detachable", "Lightweight and versatile, for easy home cleaning. Instant release trigger means battery power is only used while it's cleaning; Requires charging for 3.5 hours minimum before first use", "Direct drive cleaner head; Up to 6 minutes of fade free power (in Max mode); Drives stiff nylon bristles into carpets to capture deep down dirt", "Powered by the Dyson digital motor V7 and engineered to pick up ground in dirt and fine dust from hard floors and carpets", "75 percent more brush bar power than the Dyson V6 cordless vacuum", "Hygienic bin emptying: No need to touch the dirt. Bin volume 0.14 gallons", "Quickly transforms to a handheld vacuum, to clean all around your home and car"], "description": "The Dyson V7 Moorhead cord-free vacuum has 75 percent more brush bar power than the Dyson V6 cord-free vacuum. Engineered for all floor types, the direct-drive cleaner head drives bristles into the carpet to remove ground-in dirt. The Dyson V7 Moorhead cord-free vacuum quickly transforms to a handheld for quick clean UPS, spot cleaning and cleaning difficult places. Cleans hard floors with extra power for carpets. With 2 additional tools. Up to 30 minutes of powerful fade-free suction. Trigger releases instantly. Battery power is only used for cleaning. The direct-drive cleaner head drives bristles deep into the carpet to remove ground-in dirt. It has 75Percent more brush bar power than the Dyson V6 cord-free vacuum. Transforms to a handheld for beyond the floor cleaning. Hygienic dirt ejector empties dust from the bin in a single action. 2 tier radial tm cyclones - 15 cyclones, arranged across two tiers, work in parallel to increase airflow and capture fine dust. Max power mode provides up to 6 minutes of higher suction for more difficult tasks. Balanced for cleaning up top, down below and in between. All Dyson cordless vacuums quickly convert to a handheld for quick clean UPS, spot cleaning and cleaning difficult places. Convenient docking station stores and charges the machine, and holds additional attachments. So it's always ready to go. Dyson received the highest numerical score among stick vacuums in the J.D. Power 2017 Vacuum Satisfaction Study, based on 6,965 total responses from 7 companies measuring the opinions of consumers who purchased a stick vacuum in the previous 12 months surveyed in February-March 2017. Your experiences may vary. Do not use to pick up flammable or combustible liquids, such as gasoline, or use in areas where they or their vapors may be present. Suction power is up to 100AW.", "hasBuyBox": "true", "soldBy": "Computer Supplies", "sellers": 27, "totalReviews": 4370, "uuid": "9dcb9695-0b48-4ca8-a712-25ecd4880704", "image": "https://images-na.ssl-images-amazon.com/images/I/31LhsvVPJpL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A18UQSTHS8A7FY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B081NWVMCH", "isPrime": "false", "url": "https://www.amazon.com/dp/B081NWVMCH", "title": "Medify MA-25 W1 Medical Grade Filtration H13 True HEPA for 500 Sq. Ft. Air Purifier | Dual Air Intake | Two '3-in-1' Filters | 99.9% removal in a Modern Design - White", "price": 160.0, "category": "Home & Kitchen", "bsr": 3915, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["NEW 2020!!!", "The Most Powerful table top air purifiers on the market with Dual Air Intakes and two filters.", "Medical Grade H13 Filters (higher rated than True HEPA) 99.9% particle removal. H13 True HEPA is considered medical grade air filtration, the unit alone is not a medical device. | Cleans a room up to 1,000 sq ft in one hour, 500 sq ft in 30 minutes, 250 sq ft in 15 minutes (CADR 250)", "Tempered Glass panel (like your cell phone, easy to clean, won't scratch like cheap plastic models), beveled edge, 3 fan speeds, 8 hr timer, night mode, child lock", "Genuine Medify Replacement Filter: ASIN B084Q965BF, 110 Volt units, USA registered Lifetime Warranty | ETL certified."], "description": "", "hasBuyBox": "false", "soldBy": "Medify Air", "sellers": 1, "totalReviews": 2379, "uuid": "edbf92f8-526a-4c8c-b989-40353c1af0ae", "image": "https://images-na.ssl-images-amazon.com/images/I/41iQqjR94wL._AC_.jpg", "variations": {"sizes": ["1-Pack", "2-Pack"], "colors": ["Black", "Silver", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A32M9WIF92ZF3R&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B07CNQQM9N", "isPrime": "false", "url": "https://www.amazon.com/dp/B07CNQQM9N", "title": "LEVOIT Air Purifier for Home Large Room with True HEPA Filter, Air Cleaner for Allergies and Pets, Smokers,Mold,Pollen,Dust,Pollutants,Quiet Odor Eliminators for Bedroom, Smart Auto Mode, LV-H133", "price": 199.99, "category": "Home & Kitchen", "bsr": 4514, "soldByAmazon": "true", "rating": 4.7, "isFba": "true", "aboutBullets": ["Professional Air Care: Breathe in air that's free of 99. 97% of 0. 3 micron airborne particles such as dust, and pollen The activated carbon filter absorbs cooking odors, household odors, smoke, and volatile organic compounds (VOCs)", "Ideal for Allergies and Pet Owners: True HEPA Filter reduces pet odors, and traps pet fur and other contaminants It also helps relieve allergies by capturing airborne contaminants such as dust, pet dander, pollen, and mold.", "Wide Coverage: Enjoy fresh air in only 30 minutes in rooms as large as 1076ft2, and 15 minutes in rooms as large as 538 ft2. Maximum benefits 538 ft2.", "Auto Mode: Stay up to date with the indicator ring's real-time air quality updates The particle sensor detects airborne contaminants and automatically adjusts fan speed accordingly.", "Quiet Environment: The air purifier makes as little noise as 25dB on its lowest setting, so it doesn't disturb you while you rest", "LED Display & Timer: Turn off the LED display to create a darker sleeping environment You can also set a timer for up to 12 hours, keeping your air fresh while you sleep", "Safe & Certified: CARB Certified, FCC Certified, ETL Listed, and Energy Star Certified"], "description": "Note: Geniune Levoit replacement filter for LV-H133 is back in stock. Pleaase search for B07DVWWC44 for purchase.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 13, "totalReviews": 1896, "uuid": "c1071203-0e92-460f-9d6b-3f5ce80a3ac8", "image": "https://images-na.ssl-images-amazon.com/images/I/51OCt7zX%2B3L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07GXB3S7Z", "isPrime": "false", "url": "https://www.amazon.com/dp/B07GXB3S7Z", "title": "Philips Hue Play Black & Color Smart Light, 2 Pack Base kit, Hub Required/Power Supply Included (Works with Amazon Alexa, Apple Homekit & Google Home)", "price": 129.99, "category": "Home & Kitchen", "bsr": 1088, "soldByAmazon": "true", "rating": 4.7, "isFba": "true", "aboutBullets": ["Includes Power Supply: Connect up to 3 Hue Play?s on 1 Power Supply unit; Requires the Hue Hub (sold separately, Model 458471); Search 'Philips Hue Hub' or 'B016H0QZ7I' to find this product on Amazon", "Voice Activated: The Philips Hue White & Color Ambiance Bar Light can be Controlled using Your Voice when you have Amazon Alexa, Apple HomeKit, or Google Assistant Enabled (Philips Hue Hub and Smart Home Device required and sold separately); Philips Hue Smart lights can also be paired for Home automation with Your existing Nest products or Samsung SmartThings system", "Limitness Posibilities: Enhance Your Smart Home with the Philips Hue Play; The Design is aesthetically pleasing and will adapt well with any living room setup; Let you Smart light stand on Your cabinet to create a pleasant ambiance, mount it on the back of Your TV or even lay it flat on the floor to brighten Your walls From floor to ceiling", "Ultimate TV Lighting Experience : Create the most beautiful backlight for Your television; Just mount Philips Hue Play behind Your screen using the clips and double sided Tape Included in the Pack, and Enhance Your viewing Experience with Splashes of light surrounding Your television", "Easy Installation : Connect Not only 1, but up to 3 Hue Plays to the same Power Supply unit, leaving enough room for other devices; With each additional Hue Play, Your Smart Lighting Experience becomes even more immersive; This base kit Includes 1 Power Supply", "Expand Your Smart Home Experience: The Philips Hue Play requires the Hue Hub (sold separately) for the Full Smart Lighting Experience; Lifetime up to 25,000 hour(s); Input Voltage: 230 V AC, 120 V AC"], "description": "Connect it to Hue Hub (sold seperately) in order to control lights with your Hue App, Voice or Smart Home device. Compact design, full light experience. Create a vibrant ambiance with the Hue Play light bars. Choose from 16 million colors to experience different light effects. Lay it on the floor, let it stand on the cabinet, or mount it on the back of the TV and paint your wall with light. Sync your lights to music or movies using the Hue Sync app. This base kit provides 2 light points, 1 power supply unit, 2 table stands and 2 TV-mounting supports. Requires the Hue Hub (sold Separately) for the full Hue experience and to take advantage of voice activation. Purchase the Philips Hue Hub (Model: 458471). Search \"Philips Hue Hub\" or \"B016H0QZ7I\" to find this product on Amazon.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 12, "totalReviews": 2821, "uuid": "8aca8da7-ec3d-4498-ae07-1ca3c693a654", "image": "https://images-na.ssl-images-amazon.com/images/I/41dMFTgeAcL._AC_.jpg", "variations": {"sizes": ["Base Kit - 1 Pack", "Base Kit - 2 Pack", "Extension"], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B01AXM4WV2", "isPrime": "false", "url": "https://www.amazon.com/dp/B01AXM4WV2", "title": "Cuisinart DFP-14BCNY 14-Cup Food Processor, Brushed Stainless Steel - Silver", "price": 229.0, "category": "Home & Kitchen", "bsr": 1195, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["Includes stainless steel Standard slicing disc (4mm), medium shredding disc and stainless steel chopping/mixing blade. Cord length : 36 Inches", "720-Watt large-capacity food processor with intuitive \"on\" And \"off/pulse\" Buttons", "14-Cup Lexan work bowl; extra-large Feed tube; small and large pushers", "Spatula, instruction/recipe booklet; dishwasher-safe parts", "Detachable disc stem", "Note: shredding and slicing blades are not adjustable.", "Refer to the user manual to ensure proper set-up and features of the unit prior to use."], "description": "", "hasBuyBox": "true", "soldBy": "A1Supply.", "sellers": 9, "totalReviews": 6123, "uuid": "91a8b0ec-0f2a-42ad-b46b-3778b63eccbb", "image": "https://images-na.ssl-images-amazon.com/images/I/41WmxbRfOIL._AC_.jpg", "variations": {"sizes": [], "colors": ["Red", "Silver", "White", "White/Gold"], "patter_name": ["Food Processor", "Food Processor + Bakers Half Sheet", "Food Processor + Disc Holder", "Food Processor + Salad Spinner"], "style_name": ["Food Processor", "Food Processor + Bakers Half Sheet", "Food Processor + Disc Holder", "Food Processor + Salad Spinner"]}, "soldByStoreLink": "https://www.amazon.com/s?me=A10HLORM3B3SKO&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01LDMXXK2", "isPrime": "false", "url": "https://www.amazon.com/dp/B01LDMXXK2", "title": "Sunnydaze Crossweave Outdoor Fire Pit - 36 Inch Large Bonfire Wood Burning Patio & Backyard Firepit for Outside with Spark Screen, Poker, and Round Fireplace Cover, Black", "price": 479.0, "category": "Home & Kitchen", "bsr": 3226, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["LARGE SIZE: Perfect to fit many people around for a bonfire on the patio, yard or garden; Overall 36 inch diameter x 24 inches high x 11 inches deep; Outdoor fire pit is 16 inches tall without spark screen and has a 31 inch inner diameter, weighs 29 pounds", "HEAVY DUTY DESIGN AND RUST RESISTANT: Deep metal firepit is made from durable 1.7mm gauge steel and finished with black high temperature paint for long lasting quality and resistance to rust; Portable function allows the fireplace to be moved anywhere and has a decorative crossweave pattern that complements any outside style", "FULL SET INCLUDED: Fire bowl set includes metal spark screen for added safety from flying sparks, top quality waterproof and weather resistant round cover, built-in wood burning grate for better air flow, and poker tool to easily control the flame", "EASY TO SET UP: Quick and easy assembly allows this fire pit to be assembled in no time; Simply attach the 3 legs and outer rim and you are ready to create cozy memories in the backyard or while camping", "1 YEAR WARRANTY: Sunnydaze Decor backs its products with a 1-year manufacturer's warranty for worry-free purchasing"], "description": "", "hasBuyBox": "false", "soldBy": "You Get A Deal", "sellers": 2, "totalReviews": 730, "uuid": "c803f7d5-0899-4147-9d17-e8756b35eadd", "image": "https://images-na.ssl-images-amazon.com/images/I/51NZlR82YGL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1EIR2HUYK24D6&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01KCK9W1K", "isPrime": "false", "url": "https://www.amazon.com/dp/B01KCK9W1K", "title": "NESCO VS-12, Deluxe Vacuum Sealer with Bag Starter Kit and Viewing Lid, Compact Design, Silver", "price": 99.99, "category": "Home & Kitchen", "bsr": 2092, "soldByAmazon": "true", "rating": 4.5, "isFba": "true", "aboutBullets": ["Double Line Seals for Added Strength", "Hands-Free Sealing with Locked Handle", "Variable Settings: Regular or Gentle", "Double Vacuum Pump", "Sealing Choices: Dry, Moist, and Double", "Included Components: vacuum sealer"], "description": "The new NESCO VS-12 Deluxe Vacuum Sealer gives you the ability to choose what settings work best for the food you are sealing. Choose from regular for firm items and gentle for softer foods. Sealing choices of dry, moist and double. The pulse vacuum option is great for sealing delicate items like buns and bakery. Simply press the manual seal button to double seal when you have reached the desired vacuum level. Features a double vacuum pump for optimal performance and double line seals for added strength. Also has a bag roll storage compartment and a bag cutter. Cord Length - 54\" cord length.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 5, "totalReviews": 1034, "uuid": "ee5054d8-f885-4fc3-9249-16fa8338a516", "image": "https://images-na.ssl-images-amazon.com/images/I/41wXvvmkJcL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B005M8GUOK", "isPrime": "false", "url": "https://www.amazon.com/dp/B005M8GUOK", "title": "Umbra Casa Tissue Box Cover - Adorable House Shaped Square Tissue Box Holder for Bathroom, Bedroom or Office, White", "price": 5.75, "category": "Home & Kitchen", "bsr": 6320, "soldByAmazon": "true", "rating": 4.5, "isFba": "true", "aboutBullets": ["CLEAN, CLEVER & CUTE DESIGN: Casa helps disguise the boring look of an ordinary square tissue box, with your tissue mimicking a puff of smoke and dispensing through the chimney of this miniature house-shaped cover", "ADORABLE TISSUE BOX HOLDER: Casa measures 5 x 6  3/4  x 5 inches and is designed to cover a standard boutique (cube-shaped) tissue box", "ADD A DECORATIVE TOUCH TO ANY ROOM: Designed by Mauricio Affonso, this imaginative take on the tissue box cover is available in multiple colors and is sure to add a decorative touch to your bathroom, bedroom, or any other room in your home or office", "EASY TO USE: For easy tissue retrieval, cut out the plastic from tissue box opening and feed the first tissue up the chimney before putting on the Casa cover; Casa is also simple to clean, just wipe down with a damp cloth", "SATISFACTION GUARANTEED OR YOUR MONEY BACK: Umbra is committed to the highest levels of quality and excellence and stand behind every product we make. We know you're going to love your purchase but if you're not completely thrilled for any reason (or even no reason at all), simply contact us within 30 days of receiving your order and we'll happily resolve the matter or issue a full refund.", "PRODUCT SPECS:Item Number:023340-660;Weight:0.44 LBS;Width:5.13 (in);Height:5.13 (in);Depth:6.75 (in)."], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 13, "totalReviews": 5310, "uuid": "0c719802-f4a8-4309-8d88-4ed1b8b93f9e", "image": "https://images-na.ssl-images-amazon.com/images/I/31TXxr-VHiL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Gray", "Surf", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B00Y8SDSQI", "isPrime": "false", "url": "https://www.amazon.com/dp/B00Y8SDSQI", "title": "Le Creuset Enameled Cast Iron Rectangular Skinny Griddle, 13\" x 8.5\", Ocean", "price": 159.95, "category": "Home & Kitchen", "bsr": 1218, "soldByAmazon": "true", "rating": 4.0, "isFba": "true", "aboutBullets": ["Le Creuset's durable black enamel finish means no seasoning is required", "Even heat distribution and superior heat retention", "Colorful, long-lasting exterior enamel resists chipping and cracking", "Strong iron handles provide a steady grip"], "description": "Not just for breakfast favorites, the Le Creuset Skinny Griddle is a convenient pan for searing steaks, pork chops, vegetables, hot sandwiches and more. The space-saving design maximizes side-by-side space on the stovetop and in the oven. The griddle's smooth surface is coated with Le Creuset's protective satin black enamel to prevent damage and wear. Over time, this slightly abrasive finish develops a natural patina that is ideal for searing and browning.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 11, "totalReviews": 58, "uuid": "e0ad68a1-24f9-470f-969f-f071f1099603", "image": "https://images-na.ssl-images-amazon.com/images/I/31UP1cJneyL._AC_.jpg", "variations": {"sizes": ["13 x 8.5\""], "colors": ["Cerise", "Deep Teal", "Flame", "Marseille", "Matte White (Cotton)", "Mist Grey (French Grey)", "Ocean", "Palm", "Quince"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B01M66NWOQ", "isPrime": "false", "url": "https://www.amazon.com/dp/B01M66NWOQ", "title": "Google Nest Cam Outdoor 2-Pack - Weatherproof Outdoor Camera for Home Security - Surveillance Camera with Night Vision - Control with Your Phone", "price": 297.99, "category": "Home & Kitchen", "bsr": 4, "soldByAmazon": "false", "rating": 4.4, "isFba": "true", "aboutBullets": ["Outdoor Wi-Fi camera 2-pack for home security with 24/7 live video", "High definition surveillance camera with a 130 degree wide angle view, 1080p HD, and 8x zoom; night vision illuminates the whole scene, even when it's dark outside", "Looks for motion and sound activity and sends an alert to your phone or email[1]", "Control your home security camera from anywhere with the app on your phone", "Built in speaker and microphone lets you listen and talk back to visitors", "Weatherproof and plugs into power so you don't have to worry about dead batteries", "Easy to install; just plug in the cable and adapter and mount the camera"], "description": "Nest Cam Outdoor is a wireless outdoor home security camera that helps you keep an eye on what matters from anywhere, rain or shine. Get an alert when there's activity.[1] Talk and listen from your phone. It's weatherproof and plugs into power. And with 24/7 surveillance, know about a break-in before it happens. [1] Some features, including mobile notifications, remote control, video streaming, and video recording, require working internet and Wi-Fi. [2] Includes all Nest cameras, speakers, and displays in the same home. [3] Chromecast Ultra requires a TV with an HDMI port, a Wi-Fi network, a Google Account, a nearby electrical outlet or USB port, and a compatible mobile device. Minimum OS requirements are available at g.co/cast/req. [4] Intelligent alerts require a Nest Aware subscription. Familiar face alerts not available on cameras used in Illinois. [5] This feature is only available with a paid subscription, and either sound detection enabled or at least one eligible camera. This feature is dependent upon network connectivity and other factors, and may not be available in all areas. Wireless devices may not be reliable for emergency communications. The 911 feature can connect you with the call center closest to the home address you provide during setup. [6] Only available with Nest Cams, Nest Hello video doorbell, and Nest Hub Max.", "hasBuyBox": "true", "soldBy": "Toddler Essentials", "sellers": 13, "totalReviews": 6298, "uuid": "7db9c734-d1b6-4618-a48d-78f98bee5b70", "image": "https://images-na.ssl-images-amazon.com/images/I/31TDZX%2BT5oL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1XYIPKM2PUF9A&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07L68S8CS", "isPrime": "false", "url": "https://www.amazon.com/dp/B07L68S8CS", "title": "FLEXISPOT Height Adjustable Standing Desk Converter - 42 inch Stand Up Desk Riser, Black Home Office Desk for Dual Monitors and Laptop M7L", "price": 169.99, "category": "Home & Kitchen", "bsr": 223, "soldByAmazon": "false", "rating": 4.8, "isFba": "false", "aboutBullets": ["*FLEXIBLE HEIGHT ADJUSTMENT*: Adjust the desk height to a level that perfectly suits you with versatile height settings.", "*EXTRA SPACIOUS WORK SURFACE*: Feel free to spread out with an extra large desktop for your computer monitor, paperwork, and desk accessories as well as an oversized u-shaped keyboard tray that accommodates flexible setup options like a 17-inch laptop or a full-sized keyboard and mouse.", "*QUICK-RELEASE, REMOVABLE KEYBOARD TRAY*: Easy one-step attachment and release gives you the option to use the desk riser with or without the keyboard tray.", "*STRAIGHT UP AND DOWN MOVEMENT*: Our workstation rises and folds vertically, within its own footprint. There's no need to make spatial accommodations, as may be required in comparable products.", "*TRUSTWORTHY*: Flexispot Sit-Stand Workstations have a 5-year warranty for the frame, medium-fiber desktop, and a 3-year warranty for the gas spring system and other mechanisms."], "description": "", "hasBuyBox": "true", "soldBy": "FlexiSpot", "sellers": 7, "totalReviews": 1963, "uuid": "c65c2f54-358a-4420-8cdc-f4d9f9a5b1fa", "image": "https://images-na.ssl-images-amazon.com/images/I/41JPiThuzuL._AC_.jpg", "variations": {"sizes": ["28\"", "32\"", "35\"", "42\""], "colors": ["Black", "Mahogany"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3686AOLDPXXOD&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B000JQM1DE", "isPrime": "false", "url": "https://www.amazon.com/dp/B000JQM1DE", "title": "Brother Sewing and Quilting Machine, CS6000i, 60 Built-in Stitches, 2.0\" LCD Display, Wide Table, 9 Included Sewing Feet", "price": 272.0, "category": "Home & Kitchen", "bsr": 1063, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["60 Unique built-in stitches: The Brother CS6000i includes 60 built-in sewing stitches, including decorative stitches and 7 styles of auto-size buttonholes", "Automatic needle threader and drop-in top bobbin: This sewing and quilting machine includes an automatic needle threader that perfectly pushes thread through the needle and a convenient, jam resistant drop-in top bobbin", "Included accessories: The CS6000i includes a hard protective case, wide table, 10 sewing feet, needle set including twin needle, 3 bobbins and more", "LCD Screen: Easily select your stitches with the touch of a button and view your selections on the LCD display", "25 Year limited warranty: The CS6000i is backed by a 25 Year limited warranty with free technical support for the life of the product"], "description": "", "hasBuyBox": "false", "soldBy": "VINKO STORE", "sellers": 13, "totalReviews": 11978, "uuid": "2f1b4281-7a07-4428-96f6-25e6251e5d1f", "image": "https://images-na.ssl-images-amazon.com/images/I/31iwl0r%2BInL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2PDTOPRYPQ02I&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B002P2ZVQ4", "isPrime": "false", "url": "https://www.amazon.com/dp/B002P2ZVQ4", "title": "Husqvarna 952711925 125B Handheld Blower, Orange", "price": 149.0, "category": "Home & Kitchen", "bsr": 1312, "soldByAmazon": "true", "rating": 4.4, "isFba": "true", "aboutBullets": ["HIGH AIR VOLUME AND VELOCITY: Powerful clearing performance featuring 425 CFM Air Volume and 170 MPH Air Velocity", "AUTO RETURN STOP SWITCH: Stop switch automatically resets to the ON position for easier starting", "CRUISE CONTROL: Variable speed throttle with cruise control can be set for easier handling", "ADJUSTABLE: The blowing tube length is adjustable for best performance. Sound power level, guaranteed (LWA)- 112 dB(A). Sound power level, measured - 109 dB(A). Sound pressure level at operators ear - 94 dB(A)", "INTUITIVE CONTROLS: The controls are well gathered and easy to access"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 11, "totalReviews": 1960, "uuid": "848a915f-de64-4791-8bf4-f31be0fc5b00", "image": "https://images-na.ssl-images-amazon.com/images/I/31rZMkU7PSL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07H2W9Y3W", "isPrime": "false", "url": "https://www.amazon.com/dp/B07H2W9Y3W", "title": "Flexispot Standing Desk 48 x 30 Inches Height Adjustable Desk Electric Sit Stand Desk Home Office Desks Whole-Piece Desk Board (Black Frame + 48 in Blacktop)", "price": 249.99, "category": "Home & Kitchen", "bsr": 3407, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["SPACIOUS WORK AREA: The large work surface measuring 48\" x 30\" is environmentally sourced and provides ample space for a variety of monitor or laptop setups, plus room for ongoing projects and office supplies.", "ELECTRIC HEIGHT ADJUSTABLE LIFT SYSTEM: The motor lift mechanism offers smoother height adjustments, from 28\" to 47.6\"(without 1\" thickness of table top included), at a speed of 1\"/second with low noise(under 50 dB) while running.", "SOLID CONSTRUCTION: An industrial-grade steel frame combined with a solid desktop allows for a 154 lbs weight capacity to support your ideal workspace setup.", "BUILT FOR WORK FROM HOME: The perfect standing desk to allow independent and remote workers to stay active, healthy, and productive while working from home. Precisely adjust your desk to your height and insert healthy movement into your day.", "PLEASE NOTE: The product will be shipped in two separate packages which may be delivered separately from each other. This product is also covered by a 5-year warranty for the frame, motor and other mechanisms, and a 2-year warranty for the controller and switch, electronics.Some steps may require a drill, which is not included."], "description": "", "hasBuyBox": "true", "soldBy": "FlexiSpot", "sellers": 4, "totalReviews": 2644, "uuid": "93526252-f724-4db9-b8fd-f38a4c139897", "image": "https://images-na.ssl-images-amazon.com/images/I/41yIuMifyEL._AC_.jpg", "variations": {"sizes": ["Basic", "Standard"], "colors": ["Black", "Gray", "Gray+white Top", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3686AOLDPXXOD&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B07D1KQ9HF", "isPrime": "false", "url": "https://www.amazon.com/dp/B07D1KQ9HF", "title": "Hamilton Beach Countertop Toaster Oven, Easy Reach With Roll-Top Door, 6-Slice, Convection (31123D), Silver", "price": 178.0, "category": "Home & Kitchen", "bsr": 6802, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Easy access to food and countertop the roll top door moves up and out of the way so you can have safe, easy access to your food before, during and after cooking", "Easy to keep clean door is up and out of the way of messy spills and drips", "Convection, bake, broil & toast 2 rack positions and included bake pan makes it easy to get started on cooking a variety of foods", "Fits 6 slices of toast, 12 inches pizza and 9 inches X11 inches bake pan Spacious interior gives you room for cooking everything from snacks to side dishes", "Easy to use contoured knobs not only is this new design easier to maneuver, but they're safer too"], "description": "You won't find a design like the Hamilton Beach easy reach toaster oven with roll-top door anywhere else. Its unique and large opening makes food easy to reach. And since the door opens above the oven, it frees up your countertop space in front. Best of all, it's easy to keep clean because food can't spill on the door. Contoured dials are easy to grip and turn, making it simple to switch between bake, broil and toast settings. The stay-on setting is safer thanks to a stop mechanism that prevents the knob from being turned to stay-on by accident. Care - This appliance is not intended for use by persons (including children) with reduced physical, sensory, or mental capabilities, or lack of experience and knowledge, unless they are closely supervised and instructed concerning use of the appliance by a person responsible for their safety. Close supervision is necessary when any appliance is used by or near children. Children should be supervised to ensure that they do not play with the appliance. Do not touch hot surfaces. Use handles or knobs. To protect against electric shock, do not immerse cord, plug, or toaster oven in water or other liquid. Unplug from outlet when not in use and before cleaning. Allow to cool before cleaning appliance and putting on or taking off parts. Do not operate any appliance with a damaged supply cord or plug, or after the appliance malfunctions or has been dropped or damaged in any manner. Supply cord replacement and repairs must be conducted by the manufacturer, its service agent, or similarly qualified persons in order to avoid a hazard. Call the provided customer service number for information on examination, repair, or adjustment. The use of accessory attachments not recommended by the appliance manufacturer may cause injuries. Do not use outdoors. Do not let cord hang over edge of table or counter or touch hot surfaces. Do not place on or near a hot gas or electric burner or in a heated oven. Extreme caution must be used when moving an appliance containing hot oil or other hot liquids. Use extreme caution when removing pan or disposing of hot grease. Do not clean with metal scouring pads. Pieces can break off the pad and touch electrical parts, creating a risk of electrical shock. Oversize foods or metal utensils must not be inserted in a toaster oven as they may create a fire or risk of electric shock.", "hasBuyBox": "false", "soldBy": "Katie's Markdowns LLC", "sellers": 1, "totalReviews": 4041, "uuid": "4d9de78e-3e16-4b26-bc7b-173d698367db", "image": "https://images-na.ssl-images-amazon.com/images/I/41JsM7xlz0L._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A180BK0IB67KFY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B08BC1RJRV", "isPrime": "false", "url": "https://www.amazon.com/dp/B08BC1RJRV", "title": "Roborock S6 Pure Robot Vacuum and Mop, Multi-Floor Mapping, Lidar Navigation, No-go Zones, Selective Room Cleaning, Super Strong Suction, Wi-Fi Connected", "price": 440.0, "category": "Home & Kitchen", "bsr": 11469, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Precision LiDAR Navigation & Z-shape Cleaning Route: Effective, detailed home-mapping and comprehensive cleaning.", "Multi-floor Mapping: Save multiple maps, along with No-go Zones for each level, all recognized automatically by the robot, total controlled by roborock app and Alexa voice control.", "Powerful 2000Pa Suction with Automatic Carpet Boost: Strong suction easily lifts dust from floors, automatic carpet boost switches to full power on carpets for deeper cleaning.", "Convenient Selective Room Cleaning: Choose which rooms to be clean, and schedule cleaning for specific rooms to fit youe needs and preferences.", "Long-Range 180ml Adjustable Water Tank: Suitable for mopping homes up to 1610sqft, adjustable for different floor types."], "description": "", "hasBuyBox": "false", "soldBy": "Amazon Warehouse", "sellers": 2, "totalReviews": 607, "uuid": "0af2c73a-29a1-4429-9328-3b8a30e9dbd5", "image": "https://images-na.ssl-images-amazon.com/images/I/31lDFyIOUYL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B00JYHNNYK", "isPrime": "false", "url": "https://www.amazon.com/dp/B00JYHNNYK", "title": "Rachael Ray Cucina Nonstick Cookware Pots and Pans Set, 12 Piece, Agave Blue", "price": 142.65, "category": "Home & Kitchen", "bsr": 852, "soldByAmazon": "true", "rating": 4.6, "isFba": "true", "aboutBullets": ["SET INCLUDES: 1-quart and 3-quart saucepans with lids, 6-quart stockpot with lid, 8.5-inch and 10-inch frying pans, 3-quart saute pan with lid, slotted turner and spoon", "DURABLE DESIGN: Nonstick pots and pans from Rachael Ray are crafted with durable aluminum and sturdy hard enamel porcelain exteriors to stand up to busy kitchens", "ENHANCED PFOA-FREE NONSTICK: Cookware set features espresso-colored, PFOA-free nonstick for effortless food release and easy cleanup", "CONVENIENCE AND CONTROL: The 12-piece nonstick cookware set boasts dual-riveted rubberized stainless steel handles and shatter-resistant glass lids; includes slotted turner and spoon", "OVEN SAFE: Oven safe to 400 degrees F, these versatile pots and pans are suitable for all stovetops except induction"], "description": "Get high performance and durability in the kitchen with the Rachael Ray Cucina Hard Enamel 12-Piece Nonstick Cookware Set. Crafted with sturdy hard enamel porcelain exteriors and durable aluminum construction that promotes fast, even heating, these versatile pots and pans incorporate the easy-to-use functionality and time-saving solutions Rachael is known for. Color meets convenience with the distinctive espresso-colored, PFOA-free nonstick that releases foods effortlessly, complements the exteriors, and cleans up easily. Rubberized stainless steel handles on the cooking set are dual riveted for added strength, and shatter-resistant glass lids seal in heat and flavor. Oven safe to 400degF, the nonstick cookware is a welcome addition to other cookware and serveware pieces in the Rachael Ray Cucina collection. Prepare delectable dishes for loved ones with the warm and rustic-styled nonstick cookware in the Rachael Ray Cucina 12-Piece Hard Enamel Nonstick Cookware Set.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 19, "totalReviews": 9677, "uuid": "6d4e5592-934f-4ff8-8468-4072bb44f421", "image": "https://images-na.ssl-images-amazon.com/images/I/51d6x96r1BL._AC_.jpg", "variations": {"sizes": [], "colors": ["Agave Blue", "Cranberry Red", "Lavender", "Lemongrass Green", "Mushroom Brown", "Pumpkin Orange", "Sea Salt Gray"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07DNTT8MR", "isPrime": "false", "url": "https://www.amazon.com/dp/B07DNTT8MR", "title": "JUMMICO Fabric Recliner Chair Adjustable Home Theater Single Massage Recliner Sofa Furniture with Thick Seat Cushion and Backrest Modern Living Room Recliners (Grey)", "price": 119.99, "category": "Home & Kitchen", "bsr": 5872, "soldByAmazon": "false", "rating": 4.3, "isFba": "false", "aboutBullets": ["Material: The Recliner covered by high quality breathable fabric with thick padding provide better comfort", "Application: Waist vibration massage function, a variety of massage mode and sleep mode to give you comfortable enjoyment. It's a good choice for living room, bedroom, home theater .The recliner back can be adjusted from 90deg - 165deg to read books, watch TV,nap time", "Footrest: Steel frame design leads to more stable; Freely adjustable angle of the footrest, Perfect for relaxation during your rest time", "Maximum capacity: 265 lbs Seat Height: 17.7\" Seat Dimensions :19.8\"(W) x 20.5\"(D) Back Dimensions:20.9\"(W) x 29.1\"(H) Open Dimensions:19.8\"(W) x 62.6\"(D) x 29.8\"(H) Closed Dimensions: 19.8\"(W) x28.8\"(D) x 38.6\"(H)", "Easy to assemble and good service: Just slide the backrest to the base connection and screw the 4 legs. If you have any questions, please contact us freely, we are glad to help you solve it"], "description": "", "hasBuyBox": "true", "soldBy": "SimonDreamer", "sellers": 14, "totalReviews": 2719, "uuid": "1ab0e04f-b0d3-4406-a906-05902b48bd30", "image": "https://images-na.ssl-images-amazon.com/images/I/51V4UUPM3yL._AC_.jpg", "variations": {"sizes": [], "colors": ["Brown", "Grey", "Light-blue", "Red"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2NJDIXJL0BV98&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0043H9FMU", "isPrime": "false", "url": "https://www.amazon.com/dp/B0043H9FMU", "title": "Fancierstudio Power Heat press Digital Heat Press 15 x 15 Sublimation Heat Press Rhinestone Heat Press T-Shirt Heat Press 15x15 B/BLK", "price": 189.99, "category": "Home & Kitchen", "bsr": 831, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["Brand new 15-by-15-inch heat press sheet included", "Voltage: 110 volts; Power: 1800 watts", "Temperature Range: 0-699 degrees F; Time Range:0-999 s", "Electronic time and heat control; precise time set-up", "Silicon-gel base board; Pressure adjustable. Teflon coating on the heat platen as been added"], "description": "Brand new model by Fancier--15-by-15-inch industrial-quality digital heat press with improvements from the previous model, including included sheet and coating on the heat platen. The silicon rubber base is now glued down. This heat press is compact and is an upward-opening model, which saves space. Ideal for applying transfers, letters, numbers, and images on t-shirts, garments, bags, mouse mats, jigsaw puzzles, ID bages, ceramic tiles, and other items.", "hasBuyBox": "true", "soldBy": "Fancierstudio", "sellers": 0, "totalReviews": 3611, "uuid": "f6d5d30d-c7e8-41e8-a7e1-1f58d13f14a2", "image": "https://images-na.ssl-images-amazon.com/images/I/41ncBEg8IOL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2ISCC5HPW8KU9&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B0872DQV7Z", "isPrime": "false", "url": "https://www.amazon.com/dp/B0872DQV7Z", "title": "Kalorik 26 QT Digital Maxx Air Fryer Oven with 9 Accessories, Roaster, Broiler, Rotisserie, Dehydrator, Oven, Toaster, Pizza Oven and Slow Cooker. Includes Cookbook. Sears up to 5000F. Extra Large Capacity, All in One Appliance. Stainless Steel. AFO 46045 SS", "price": 199.0, "category": "Home & Kitchen", "bsr": 4075, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["MODERN AND MULTIFUNCTIONAL: The Kalorik MAXX Air Fryer Oven combines the functionality of 10 different appliances into a single unit. The MAXX's easy-to-use digital LED display includes 21 presets for foolproof cooking no matter the occasion.", "EXTREME PERFORMANCE: The highly efficient Turbo MAXX airflow system produces air temperatures up to 500degF to cook food 30% faster than other leading air fryer ovens and 50% faster than standard conventional ovens. This delivers the same crispy texture and rich flavor of deep-fried food using little to no oil--reducing fat and calories for healthier meals.", "LARGE FAMILY SIZE: The MAXX's extra-large 26-quart cavity can roast a whole chicken, bake a 12\" pizza, or toast 9 slices of bread with room to spare--perfect for preparing dinner for the whole family.", "ACCESSORIES INCLUDED: Comes with everything needed to prepare delicious meals right out of the box. Includes an air frying basket, air rack, bacon tray, baking pan, crumb tray, rack handle, rotisserie handle, rotisserie spit, and steak tray. Also includes a cookbook with 40 inspirational recipes to help you get started.", "90 YEARS OF EXCELLENCE: Established in Belgium in 1930, Kalorik has been manufacturing kitchen appliances for over nine decades. The Kalorik name is synonymous with superior engineering and cutting-edge innovation, and The MAXX represents the culmination of our mission to make cooking easier for everyone. Each product is ETL certified and backed by a 1-year standard warranty."], "description": "", "hasBuyBox": "false", "soldBy": "Kalorik LLC", "sellers": 21, "totalReviews": 881, "uuid": "f8f7d1f0-cd26-47f4-aa59-a653606ad132", "image": "https://images-na.ssl-images-amazon.com/images/I/41yrt4rHZ%2BL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1OFQLTV09RK75&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B075F4YTVF", "isPrime": "false", "url": "https://www.amazon.com/dp/B075F4YTVF", "title": "Kenmore 81214 200 Series Pet Friendly Lightweight Bagged Canister Vacuum with HEPA, 2 Motor System, and 3 Cleaning Tools, Orange", "price": 219.0, "category": "Home & Kitchen", "bsr": 3837, "soldByAmazon": "false", "rating": 4.1, "isFba": "false", "aboutBullets": ["BAGGED CANISTER VACUUM: Designed to clean all areas and surfaces of your entire home, den, kitchen, car or garage quickly and efficiently", "HEPA FILTER SYSTEM: Enhanced HEPA filter system traps 99. 97% of debris, trapping dander and dust inside the vacuum reducing allergy-induced pollutants in the room", "POWERFUL CLEANING: 2-motor system excels in suction strength. 4 height adjustments provide optimal airflow and cleaning efficiency for any surface", "LIGHTWEIGHT AND MANEUVERABLE: At less than 20 pounds, this lightweight design is easy to maneuver", "3 ATTACHMENTS: Dusting brush, crevice tool and bare floor tool for convenient cleaning transitions, store on the vacuum", "ENHANCEMENTS: 9 foot attachment reach, 24 foot retractable cord"], "description": "Kenmore 200 Series bagged canister vacuum - top to bottom clean. Say goodbye to dust bunnies, pet dander and more with the Kenmore 200 Series bagged canister vacuum. Powerful yet lightweight, this handy companion features a HEPA filtration system to rid the air of common allergens, and a whole home cleaning design to tackle any type of floor covering. With a convenient adjustable height to eliminate slouching and bending, plus an automatic cord Rewind to prevent tripping, this canister vacuum is your secret Weapon to a spic and span household. Compatible with Kenmore Canister HEPA Bags, 2-Pack, 02053291. Please check the connection on the wand and vacuum because if the wand is not pushed in firmly, the connection is not established. Additionally, if the vacuum bag is not routinely changed, it can burn up the motor.", "hasBuyBox": "true", "soldBy": "Skybest Appliance & Tools Center", "sellers": 1, "totalReviews": 3037, "uuid": "424fc156-6753-498c-98d4-90d74011f37d", "image": "https://images-na.ssl-images-amazon.com/images/I/31D-AGVnQJL._AC_.jpg", "variations": {"sizes": ["200 Series", "400 Series + Telescoping Wand", "600 Series + Pet PowerMate", "Pet PowerMate + Dirt Sensing Technology", "Pet PowerMate + Ultra Plush Capability"], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2YY8IX604KF21&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B08GP3GQVQ", "isPrime": "false", "url": "https://www.amazon.com/dp/B08GP3GQVQ", "title": "BERLMAN Ergonomic High Back mesh Office Chair with Adjustable Armrest Lumbar Support Headrest Swivel Task Desk Chair Computer Chair", "price": 189.99, "category": "Home & Kitchen", "bsr": 5396, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Breathable-- Mesh back office chair with lumbar support office chair keep you comfortable all day work.", "Durability-- desk chair frame made of High quality material which can be used for years.", "Adjustable-- Foldable armrest & Seat height and backrest leaning function when you need rest.", "Comfortable-- High dinsity sponge and wide seat offer super suport for your body.", "Easy to assemble-- Come with clear instruction, Sturdiness footbase and wheels be made for 250lb capacity."], "description": "", "hasBuyBox": "true", "soldBy": "Zenith Furniture Inc.", "sellers": 0, "totalReviews": 221, "uuid": "4a0ee77b-7628-4b6b-b204-f6350e36be7a", "image": "https://images-na.ssl-images-amazon.com/images/I/518PkexrCeL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A3TP1HVO48DNE4&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0000CBK1L", "isPrime": "false", "url": "https://www.amazon.com/dp/B0000CBK1L", "title": "Brother 1034D Serger, Heavy-Duty Metal Frame Overlock Machine, 1,300 Stitches Per Minute, Removeable Trim Trap, 3 Included Accessory Feet", "price": 399.0, "category": "Home & Kitchen", "bsr": 1678, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["METAL FRAME: The Brother 1034D is a durable serger made with a high-quality metal frame and interior components", "HIGH PERFORMANCE: A reliable 3 or 4 thread serger that can handle multiple layers of denim and other heavy materials", "1,300 STITCHES PER MINUTE: Get more serging done in less time by sewing up to 1,300 stitches per minute. Control speed with the included foot pedal", "EASY TO THREAD: Easy-to-use, color-coded upper thread guide and lower looper threading system along with included instruction manual and instructional video", "INCLUDED ACCESSORY FEET: The 1034D comes with 3 snap on feet including standard, gathering and blind stitch"], "description": "", "hasBuyBox": "false", "soldBy": "A Reselling Company", "sellers": 7, "totalReviews": 6039, "uuid": "d6dfdfc5-3ae9-49ff-ad8d-291bc51f7da2", "image": "https://images-na.ssl-images-amazon.com/images/I/4186jt6OMtL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3AJC3ZUSNFN7H&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07JJ848L8", "isPrime": "false", "url": "https://www.amazon.com/dp/B07JJ848L8", "title": "GTRACING Gaming Chair with Footrest Big and Tall Office Executive Chair Heavy Duty Adjustable Recliner with Headrest Lumbar Support Cushion Desk Chair Black", "price": 169.0, "category": "Home & Kitchen", "bsr": 7898, "soldByAmazon": "false", "rating": 4.3, "isFba": "false", "aboutBullets": ["PERFECT FOR GAMING: GTRACING is dedicated to make the best gaming chair for pro gamers. Choose us, and improve your gaming experience! Dimensions:20.47\"(L) x 21.26\"(W) x 48.8\"-52\"(H); Maximum weight capacity: 350 pounds.", "ERGONOMIC DESIGN: Strong metal frame designed to help promote a comfortable seated position. Thick padded back & seat,and retractable footrest take this chair to the next level of comfort.", "MULTI-FUNCTION: Armrest and seat-height adjustable; 90~170degreclining and rocking; 360degswivel; 6- point base built with heavy duty; Smooth-rolling casters; Removable headrest pillow and lumbar cushion; Retractable footrest.", "HIGH-QUALITY MATERIAL: Smooth PU leather, added seat cushion, and lumbar & headrest pillows offer added support and comfort. Heavy-duty base and nylon smooth-rolling casters for great stability and mobility.", "[?]NOTICE* Due to COVID-19 and other incidents recently, our warehouse in California has been affected. It may take a little more time than usual to scan and ship products from California. Thanks for your understanding."], "description": "", "hasBuyBox": "false", "soldBy": "", "sellers": 0, "totalReviews": 2491, "uuid": "6156d7f5-ede7-480a-a237-bb733344a90d", "image": "https://images-na.ssl-images-amazon.com/images/I/41PK499s2OL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A25EMYIGO0RE3E&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": null},
{"asin": "B081346BN2", "isPrime": "false", "url": "https://www.amazon.com/dp/B081346BN2", "title": "APOSEN Cordless Vacuum, Stick Vacuum Cleaner 4 in 1 with 21000pa Super Suction, Ultra-Lightweight & Quiet Vacuum for Deep Cleaning Home Hard Floor Carpet Pet Hair H21", "price": 245.0, "category": "Home & Kitchen", "bsr": 18852, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["APOSEN is a brand new and experienced household brand, we deeply know how important our customer shopping experience is, based on never failed our customer spirit, we did a lot of research and made a lot improvement on many vacuum cleaner in the market. Here it comes!", "[(21000Pa Powerful Suction)] Cordless vacuum equipped with a brushless high-power motor and the upgrade version provides up to 21000Pa super suction in Turbo mode, delivers a perfect carpet-cleaning performance, and ideal for deep, thorough cleaning large particles, bread crumbs, pet hair, etc", "[(Large Capacity Battery)]  Powerful 6-cell 2000mAh top lithium-ion batteries provide up to 30 mins fade-free runtime and advanced fast charging technology, the quick charge tech will ensure the vacuum can full charge in 4 hours and one charge is equivalent to twice the runtime time of other cordless vacuum.", "[(Latest Filtration Technology)] Cordless vacuum cleaner uses cyclone technology combined with a high-density filter to trap more than 99.99% of dust, pollen and pet dander, and prevent secondary air pollution and provide you with excellent cleaning experience.", "[(Lightweight&Multi Versatile Attachments)]  Easily converts from stick vacuum to a handheld vacuum with versatile attachments, effective cleaning up from floor to high places, deep cleaning the house, allows you to reach corners, stairs and crevices., and even in the car.", "[(Easy to Use and Storage)] One button start/ turn off. APOSEN cordless vacuum cleaner provides two power modes at the same time, which can switch strong suction mode (21Kpa) to standard suction mode (12Kpa) according to location and application as you like. The extension wand fit for different height cleaning and can be storage compactly near closet or at corner."], "description": "", "hasBuyBox": "false", "soldBy": "Katie's Markdowns LLC", "sellers": 1, "totalReviews": 331, "uuid": "5c51be10-c779-4034-9db3-3fef9a16a35d", "image": "https://images-na.ssl-images-amazon.com/images/I/316c6Ya7MhL._AC_.jpg", "variations": {"sizes": [], "colors": ["Grey/White", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A180BK0IB67KFY&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07QGY4VGK", "isPrime": "false", "url": "https://www.amazon.com/dp/B07QGY4VGK", "title": "GTRACING Gaming Chair with Footrest and Bluetooth Speakers Music Video Game Chair[(Patented Design)]  Heavy Duty Ergonomic Computer Office Desk Chair Red", "price": 179.0, "category": "Home & Kitchen", "bsr": 5099, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": [" MUSIC GAMING CHAIR: Original designed with two Bluetooth speakers. The surround sound system brings out the best in your entertainment, delivering remarkable and richly detailed stereo sound out loud in solid bass and clear, full audio. Connect it to your smartphone, tablet or other Bluetooth-enabled devices, and enjoy music, mobile game or movie with thrilling, cinema-like sound from the comfort of your gaming chair.", " ERGONOMIC DESIGN: Strong metal frame designed to help promote a comfortable seated position, keeping you comfy after long hours of game or work. Thick padded back & seat and retractable footrest are perfect for relaxing.", " MULTI-FUNCTION: Bluetooth speakers for 6-hour music play; Relaxing footrest; Armrest and seat-height adjustable; 90~170degreclining; Rocking; 360degswivel; Removable headrest pillow and lumbar cushion for added support.", " HIGH-QUALITY MATERIAL: Smooth PU leather upholstery. Thick padded seat cushion made of high density foam. Heavy-duty chair base and nylon smooth-rolling casters for great stability and mobility. Weight Capacity: 300lbs", "[?]NOTICE* Due to COVID-19 and other incidents recently, our warehouse in California has been affected. It may take a little more time than usual to scan and ship products from California. Thanks for your understanding."], "description": "", "hasBuyBox": "true", "soldBy": "GTRACING Direct", "sellers": 0, "totalReviews": 2442, "uuid": "0f360a2c-faf5-4e57-b76d-d1500897fe5f", "image": "https://images-na.ssl-images-amazon.com/images/I/41oZCul641L._AC_.jpg", "variations": {"sizes": [], "colors": ["Blue", "Gray", "Pink", "Purple", "Red"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A25EMYIGO0RE3E&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B004KH4LAE", "isPrime": "false", "url": "https://www.amazon.com/dp/B004KH4LAE", "title": "Hiland HLDSO1-WGTHG Pyramid Patio Propane Heater w/Wheels, 87 Inches, Hammered Bronze", "price": 480.0, "category": "Home & Kitchen", "bsr": 1020, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["Your purchase includes One Hiland HLDSO1-GTHG 91-Inch Pyramid Propane Patio Heater with wheels in Hammered Bronze color. Cover not included", "Patio heater dimensions: 21.5\" W x 21\" D x 91\" H. Product weight: 65 lbs. Coverage area: 10 sq Ft. Clearance space: Top - 36\"/91.4cm. Side - 24\"/60.9 cm", "Includes a reliable igniter and a Safety auto shut off tilt valve", "Uses standard 20 lb Propane tank that lasts between 8-10 hrs. on High mode. Butane Heat output: 40,000BTU", "The latest in design and heat, the Quartz Glass Tube Flame Heater brings style to outdoor heating. Its unique, visually mesmerizing flame provides heat in every direction"], "description": "", "hasBuyBox": "false", "soldBy": "Hensel Products", "sellers": 34, "totalReviews": 1295, "uuid": "f4037f1b-cb00-47e9-96d6-50ee2b3ebb5b", "image": "https://images-na.ssl-images-amazon.com/images/I/31N7CvE%2BJ3L._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Hammered Bronze", "Hammered Silver", "Matte Black", "Silver"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1MAIPHC5QLEYQ&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B08CKJWSFS", "isPrime": "false", "url": "https://www.amazon.com/dp/B08CKJWSFS", "title": "Philips Hue 555334 BLE Lightstrip LED Light strip, 2m / 6ft Base Kit", "price": 79.99, "category": "Home & Kitchen", "bsr": 4822, "soldByAmazon": "true", "rating": 4.6, "isFba": "true", "aboutBullets": ["COMPATIBILITY: NOTE: These are NOT compatible with the Non-Bluetooth light strip extension. To extend this strip, please use the Bluetooth extension. Expand with any voice or Smart Home assistant. Works with Alexa, Google Assistant, Apple Homekit, Microsoft Cortana, SmartThings, IFTT. Hub required, Alexa device).", "HASSLE-FREE CONNECTIVITY: These smart lightstrips are bluetooth-enabled and simple to connect. Control up to 50 smart lights on one Hue Hub without clogging up your Wi-Fi network.", "HOW TO USE: Install the flexible Bluetooth LightStrip under bars, bed frames, or cabinets, with the included adhesive tape. Trim it to the perfect size with the included cut marks. Connect up to 32 feet of extension per base kit.", "BEAUTIFUL, OPTIMAL DESIGN: The coating around the Lightstrip helps to create a single, bright, and vibrant colored light across the entire strip for a more aesthetically pleasing Smart Home.", "ULTIMATE ENTERTAINMENT EXPERIENCE: Sync your hue lightstrip plus with Gaming, Music and Movies using your PC via the Hue Sync app."], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 6, "totalReviews": 79, "uuid": "dc947b84-0222-4278-bdcc-eae13af00dca", "image": "https://images-na.ssl-images-amazon.com/images/I/41Ip09OW9hL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B00BWYO2FW", "isPrime": "false", "url": "https://www.amazon.com/dp/B00BWYO2FW", "title": "Honeywell HPA100 True HEPA Allergen Remover", "price": 208.0, "category": "Home & Kitchen", "bsr": 8303, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["Medium room air purifier: Recommended for medium rooms (up to 155 square feet) this true HEPA allergen remover air purifier helps capture up to 99.97 percent of airborne particles as small as 0.3 microns", "Easy to Use; With quiet operation, Easy Tap controls & an Auto Off Timer, this air purifier helps remove particles like pet dander, pollen, dust, mold & smoke, & helps capture certain germs & reduce odors", "Honeywell air purifiers: Our air purifiers help remove allergens, dust & odors. If you have allergies, pets or stale indoor air, air purifiers help remove airborne particles & help improve air quality", "Filter & circulate: Honeywell Air Purifiers filter & circulate air in the stated room size up to 5 times an hour. Breathe easy knowing the air in your home is fresher & cleaner with fewer allergens", "Honeywell quality: Improve your air quality & neutralize odors for a clean & healthy breathing experience year round with Honeywell replacement filters for air cleaners & purifiers"], "description": "Honeywell True HEPA Allergen Remover captures up to 99.97 percent of microscopic allergens, .3 microns or largercfmTobacco Smoke: 100,Dust: 106,Pollen: 100. 2, 4, or 8 hour automatic shut-off timer, Control Panel Dimmer, Product Weight: 7.74 lbs.", "hasBuyBox": "false", "soldBy": "AMZ CYBERBEAR 1", "sellers": 1, "totalReviews": 1648, "uuid": "efcb76e2-484f-4c0f-a4ca-d757c7e7ad6a", "image": "https://images-na.ssl-images-amazon.com/images/I/41HIdDna98L._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3SDVO14SNAVYO&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B0771GVCV3", "isPrime": "false", "url": "https://www.amazon.com/dp/B0771GVCV3", "title": "Dyson Ball Multi Floor Origin High Performance HEPA Filter Upright Vacuum Fuchsia - Corded", "price": 304.99, "category": "Home & Kitchen", "bsr": 12503, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["Dyson Ball Multi Floor Origin High Performance HEPA Filter Upright Vacuum Fuchsia - Corded", "Instant-Release High-Reach Wand and Includes Accessories for all Floor, Delicate, Pet and Hard to Reach Surfaces. Radial Root Cyclone Technology captures dirt and microscopic dust, Self-adjusting cleaner head seals in suction across carpets and hard floors", "Includes Dyson Ball Origin Upright Vacuum, Combination Tool, Stair Tool, Lifetime Washable HEPA Filter.", "Ball Technology for easy steering. Certified Asthma and Allergy Friendly. Traps allergens and bacteria. Whole-machine HEPA filtration. No other vacuum expels cleaner air.", "Please note - This not a Cinetic Big Ball. Measures 15-1/2\"L x 13-1/2\"W x 42-1/2\"H, weighs 17.4 lbs; Cord 35'L ETL listed; 5-year Limited Manufacturer's Warranty"], "description": "The Dyson Ball Multi Floor Origin upright has a self-adjusting cleaner head that automatically adjusts between carpets and hardfloors a sealing in suction. The bristles on the brush bar have been made shorter and stiffer allowing deeper carpet penetration, while maintaining superior performance on hard floors. Its wand and hose release in one smooth action to make it easier to clean up high and under furniture. With hygienic bin emptying, thereas no need to get your hands dirty a just push the button to release the dirt. And whole-machine HEPA filtration ensures that allergens and bacteria are trapped inside the trapped inside the machine, not expelled back into the home.", "hasBuyBox": "true", "soldBy": "TerraceMall", "sellers": 23, "totalReviews": 831, "uuid": "35b46665-d6ed-4d8c-a768-c33094ec7b1c", "image": "https://images-na.ssl-images-amazon.com/images/I/31OmMcxTHOL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1OBUG0QNZ2P1C&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00OCSNMO2", "isPrime": "false", "url": "https://www.amazon.com/dp/B00OCSNMO2", "title": "STAPLES Hyken Technical Task (Black, Sold as 1 Each) -Adjustable Breathable Mesh Material Provides Lumbar, arm and Head Support, Perfect Desk Chair for The Modern Office", "price": 181.99, "category": "Home & Kitchen", "bsr": 2182, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Sold as 1 Each.", "BREATHABLE MESH MATERIAL: This high-back office chair has a mesh breathable back that offers a modern look while keeping you cool. Built for both form and function, the mesh upholstery allows air to circulate while providing enough support for your body.", "EASILY ADJUSTABLE: Adjustable tilt tension and tilt lock let you find an ideal seating angle, and height adjustment options make it easy to find the proper configuration for your desk. Plus, each arm on this desk chair adjusts height for ultimate comfort.", "DIMENSIONS: This mesh task chair measures 45.3\" - 49.8\" H x 27.2\" W x 27.3\" D. Designed with sturdy carpet casters, this executive office chair can support up to 250 pounds over a full workday and easily roll across your office floor.", "WE ARE STAPLES: The line between work and life is blurring. We have solutions to keep your teams productive, connected and inspired. Whether you know exactly what you need, or you're looking for tools and inspiration to hit goals, Staples is here for you."], "description": "", "hasBuyBox": "true", "soldBy": "Amazing Deals Warehouse ", "sellers": 11, "totalReviews": 604, "uuid": "0a2358a2-bf47-49af-a22b-49914ed00d60", "image": "https://images-na.ssl-images-amazon.com/images/I/413aXYxy%2ByL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Charcoal Gray", "Red"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3KLM90F233CMK&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01L3QLQ98", "isPrime": "false", "url": "https://www.amazon.com/dp/B01L3QLQ98", "title": "Shark Lift-Away Pro Steam Pocket Mop (S3973D), White", "price": 159.99, "category": "Home & Kitchen", "bsr": 2798, "soldByAmazon": "true", "rating": 4.6, "isFba": "true", "aboutBullets": ["2-in-1 steam pocket mop with Removable handheld steamer for above-floor cleaning", "Intelli-mop head with touch-free pad attach and release technology", "Steam blaster blasts stuck-on messes", "Dual-sided dirt grip pads", "3 levels of Intelligent steam control to easily dust, mop and scrub. Machine wash Dirt Grip pads separately with warm water and liquid detergent. Avoid bleach and fabric softeners", "3 feet. Above-Floor Accessory Hose"], "description": "The Shark Lift-Away Pro Steam Pocket Mop offers the ultimate in versatility and cleaning efficiency. Blast away tough stains, sanitize* sealed hard floors, or convert to a portable handheld steamer for above-floor cleaning and garment steaming. *Sanitization studies were conducted under controlled test conditions. Household conditions and results may vary. With the Intelli-Mop head only in HI mode. Not in above-floor mode or when using the Steam Blaster.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 12, "totalReviews": 1054, "uuid": "52e65189-b2f5-4461-81c8-8a6d81302348", "image": "https://images-na.ssl-images-amazon.com/images/I/31OZQgp1bJL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07WD6S4QR", "isPrime": "false", "url": "https://www.amazon.com/dp/B07WD6S4QR", "title": "BLACK+DECKER POWERSERIES Extreme Cordless Stick Vacuum Cleaner for Pets, Purple (BSV2020P)", "price": 199.99, "category": "Home & Kitchen", "bsr": 28337, "soldByAmazon": "true", "rating": 4.4, "isFba": "true", "aboutBullets": ["3X Cleaning System designed for multi-surface clean up, multi-debri pick up, and an anti-tangle brush bar", "Upto 75% better pick up on carpet (compared to Black+decker HCUA525JP)", "Patented brush bar with rubber bristles engineered to remove pet hair and stubborn dirt", "Twist to clean: Built-in filter cleaner provides Upto twice the suction", "Removable battery compatible with 20V Max BLACK+DECKER power tools; charge in or out of vacuum", "Upto 55 minutes of runtime", "3-speed control for cleaning hard floors, area rugs, and carpet"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 0, "totalReviews": 566, "uuid": "950e5632-7b85-4759-810f-dea829c2e67f", "image": "https://images-na.ssl-images-amazon.com/images/I/41Lowg4dT3L._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07QPW9HL6", "isPrime": "false", "url": "https://www.amazon.com/dp/B07QPW9HL6", "title": "NuWave OxyPure Large Area Smart Air Purifier - Capture and Eliminate Smoke, Dust, Pollen, Mold, Pet Dander, Allergens, Lead, Formaldehyde, Gases, Bacteria, VOCs & Germs - NuWave Air Purifiers for Home", "price": 599.99, "category": "Home & Kitchen", "bsr": 25451, "soldByAmazon": "false", "rating": 4.4, "isFba": "true", "aboutBullets": ["CLEAN, HEALTHY AIR: The NuWave OxyPure Smart Air Purifier helps clean the air in your home of lead, mold, dust, pollen, smoke, pet dander, allergens, bacteria, viruses, gases & volatile organic compounds, so every breath your family takes is cleaner.", "BETTER SLEEP: The NuWave OxyPure Air Purifier helps you sleep better by eliminating airborne allergens and pollutants that can irritate your sinuses, nasal passages and lungs; while the whisper-quiet Sleep Mode helps promote ideal sleeping conditions.", "Wi-Fi capabilities: The NuWave OxyPure Smart Air Purifier saves on energy with its energy-efficient smart-touch controls and auto-monitoring capabilities that can be remotely monitored and controlled from anywhere in your home with your Wi-Fi-enabled smart device.", "ADVANCED FILTRATION: NuWave OxyPure's 5-Filter System includes a reusable, stainless-steel Pre-Filter (20-year lifespan), a Bio-Guard Filter (20-year lifespan), an Ozone Emission Removal Filter (20-year lifespan), and a combination HEPA/Activated Carbon Filter.", "Live Well for Less: For over two decades, we have truly lived up to our philosophy. We are driven by the pursuit of safe, green products that improve the quality of life and we commit to exceeding industry-standards regarding safety and product quality."], "description": "", "hasBuyBox": "true", "soldBy": "Houseware Connection", "sellers": 5, "totalReviews": 284, "uuid": "4159ac20-5e98-4c68-8c0f-a628c3457dfd", "image": "https://images-na.ssl-images-amazon.com/images/I/41mbut6%2BKcL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1B2DRTIRXZUVG&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B08FVWKK7T", "isPrime": "false", "url": "https://www.amazon.com/dp/B08FVWKK7T", "title": "KitchenAid KCO124BM Digital Countertop Oven with Air Fry, Black Matte", "price": 159.0, "category": "Home & Kitchen", "bsr": 5201, "soldByAmazon": "true", "rating": 4.3, "isFba": "true", "aboutBullets": ["No flip, perfect air fry creations with the No-Flip Air Fry Basket and 360deg Air Fry System for everything from fresh cut french fries, delicate fish and more - perfect every time, with no flipping.", "Even-Heat Convection Technology - top and bottom heating element design and convection fan ensure the inside of the oven is heated to, and stays at the right temperature.", "Large Capacity to Create - From a sheet cake to full one-pan dinner (9x13\" baking pan included), or up to 2 full size chickens (3.4 lbs each).", "9 Essential Cooking Techniques. From proofing and dehydration, to toasting and air frying, now you can create anything you can imagine.", "Fast Preheat - Ready to bake in under 4 minutes.", "Model KCO124 includes (1) Air fry basket, (1) 9x13-inch baking pan with grill rack, (1) Removable metal drip and crumb tray, (1) Removable metal rack"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 1, "totalReviews": 33, "uuid": "5fd0067b-5669-4c41-9a8b-5f4d83b13167", "image": "https://images-na.ssl-images-amazon.com/images/I/41EwMFYuqSL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07CH61ZGX", "isPrime": "false", "url": "https://www.amazon.com/dp/B07CH61ZGX", "title": "Christopher Knight Home Dax Barstools, 2-Pcs Set, Snake Skin Brown", "price": 155.98, "category": "Home & Kitchen", "bsr": 26906, "soldByAmazon": "true", "rating": 4.6, "isFba": "true", "aboutBullets": ["Modern design: with clean, precise lines, Our barstool Set is the ideal modern accessory for your interior space. Finished with curved seating contrasted with sleek straight legs, These stools not only offers a chic, minimalistic look but also provides incredible structure.", "Upholstered: our barstool Set is generously upholstered, giving any room a Refined appearance. This provides a smooth, immaculate texture for this piece as well as a cushioned Seat for comfort.", "Steel frame: The legs of these stools consist of Steel material, making this incredibly durable and ensures that these will hold up under use. Finished with a Matte Black color, this frame emphasizes its modern style.", "Dimensions: Choose an accessory that is the perfect size for you and your furniture. Each stool is 18. 75\" W x 20. 25\" D x 37. 00\" H. You will love how much your space can transform with the Simple addition of this charming barstool Set.", "Assembly required: some assembly is required for this Set of Barstools. All of the instructions and tools needed for assembly are included. This comes as a Set of two.", "Seat dimensions: 14. 00 inches deep x 17. 00 inches wide x 29. 00 inches high", "Foot rail Height: 12. 00 inches"], "description": "Perch yourself at your home bar or kitchen island and enjoy the sun filtering through your windows as you savor a delectable breakfast. Our barstool set is a stunning addition to any home with its curved seating and sleek matte base. Featuring a faux snakeskin design with intricate stitching, these barstools will instantly upgrade your decor with a touch of modern. Not only are they the perfect bar height but they also feature a stylish, beautifully curved foot rails that provide an extra boost comfort while you wine and dine.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 12, "totalReviews": 584, "uuid": "d1505443-6cad-4818-a2c9-809835dc39df", "image": "https://images-na.ssl-images-amazon.com/images/I/31iJWBdzQcL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B0055SNR2A", "isPrime": "false", "url": "https://www.amazon.com/dp/B0055SNR2A", "title": "Hoover UH30600 WindTunnel Max Bagged Upright Vacuum Cleaner, with HEPA Media Filtration, 30ft. Power Cord, Red", "price": 179.99, "category": "Home & Kitchen", "bsr": 24868, "soldByAmazon": "true", "rating": 4.1, "isFba": "true", "aboutBullets": ["Windtunnel 3 technology: Creates channels of suction to lift and remove surface and deeply embedded dirt", "HEPA filter: Traps in 99. 7% of dirt, dust, pollen, and allergens down to 0.3 microns and one simple touch releases the bag into the trash, so you never need to touch it", "Multi-floor adjustment: Features 7 floor height adjustment settings so that you can move between hard floors and deep carpets with ease", "Above floor cleaning: Up to 17 feet of above floor cleaning to reach ceilings, fans, crown moldings and more", "Tools included: Telescoping Extension Wand, 12 inch crevice tool, upholstery/dusting brush, and a air powered hand tool"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 12, "totalReviews": 1660, "uuid": "352f9dac-2b6d-4be9-82a8-5055997e8e7b", "image": "https://images-na.ssl-images-amazon.com/images/I/41XVy0JSjSL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B089SPJN2D", "isPrime": "false", "url": "https://www.amazon.com/dp/B089SPJN2D", "title": "TaoTronics Dehumidifier 50 Pints, 4500 Sq. Ft Energy Star Dehumidifier with Pump, 6L Water Tank, Intelligent Humidity Control, Continuous Drainage for Living Room/Basement/Closet/Bedroom/Bathroom", "price": 249.99, "category": "Home & Kitchen", "bsr": 19752, "soldByAmazon": "true", "rating": 4.9, "isFba": "true", "aboutBullets": ["Outstanding Efficiency: ENERGY STAR certified dehumidifier removes 50 pints(70 pint 2012 DOE standard) of moisture a day from large rooms up to 4,500 sq. ft., perfect for the living room, basement, bedroom, closet, bathroom, etc", "Smart Dehumidification: Built-in humidity and temperature sensor intelligently maintains room humidity in the comfortable range of 45%-55% - based on the ambient temperature", "Easy Drain Access: Press the \"Pump\" button to divert water out to either the basement window or into the sink; simply connect a hose (not included) to the drain outlet for continuous drainage via gravity", "Auto On/Off Timer: Program the 24hr on/off timer to auto start and stop removing excess moisture while you sleep or you're away from home for worry-free dehumidification and superior energy efficiency", "Overflow Protection: When the 6L water tank is full, dehumidifier will automatically shut off and illuminate the full tank indicator to alert you to empty the tank"], "description": "TaoTronics - Enhance Your Life", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 4, "totalReviews": 630, "uuid": "7685e116-6ab5-4f41-baff-ff0ab8afcb4c", "image": "https://images-na.ssl-images-amazon.com/images/I/31lDQOB3f3L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B06XVN2HVX", "isPrime": "false", "url": "https://www.amazon.com/dp/B06XVN2HVX", "title": "KitchenAid KP26M9XCCU 6-Quart Bowl-Lift Professional Stand Mixer, Contour Silver", "price": 399.0, "category": "Home & Kitchen", "bsr": 1315, "soldByAmazon": "true", "rating": 4.8, "isFba": "true", "aboutBullets": ["With over 14 Optional attachments* to make everything from fresh pasta to burgers, veggie noodles, ice cream and more sold separately", "6 quart stainless steel bowl for up to 10 dozen cookies", "Bowl-lift design raises and lowers the bowl and provides sturdy bowl support for mixing heavy ingredients or large quantities", "10 optimized speeds and 67 touch points around the mixer bowl for great mixing results", "Includes Bowl-Lift stand mixer, 6-quart dual-finish bowl, Coated Powerknead spiral dough hook, Coated flat beater, professional style wire whip and pouring shield", "For any product related queries contact_us on: [1-800-541-6390]"], "description": "The KitchenAid professional 600 series 6 quart Bowl-Lift stand mixer is perfect for heavy, dense mixtures. It also offers the Capacity to make up to 13 dozen cookies in a single batch and 10 speeds to thoroughly mix, knead and whip ingredients quickly and easily. For even more versatility, Use the power hub to turn your stand mixer into a culinary center with over 10 Optional hub powered attachments, from food grinders to pasta makers and more.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 0, "totalReviews": 565, "uuid": "50eb117f-e0cf-4ef1-a503-a1e6aaa037ec", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2BOEn6cauL._AC_.jpg", "variations": {"sizes": ["6 Qt", "6 quart"], "colors": ["White", "Contour Silver", "Empire Red", "Onyx Black"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B087CG9MYK", "isPrime": "false", "url": "https://www.amazon.com/dp/B087CG9MYK", "title": "Eureka Groove Robot Vacuum Cleaner, Wi-Fi Connected, App, Alexa & Remote Controls, Self-Charging, NER300", "price": 175.76, "category": "Home & Kitchen", "bsr": 37538, "soldByAmazon": "true", "rating": 3.7, "isFba": "true", "aboutBullets": ["Perfect for day-to-day cleaning maintenance: 2000Pa of suction power and a high efficiency filter help tackle dust, dirt, pet hair and crumbs on both hard floor and low-pile carpets", "Four ways to control: Use the Eureka app to schedule and control the robotic vacuum cleaner from anywhere or use Alexa and Google Assistant voice control. If you prefer offline, simply use the remote or manually control with the on-unit button.", "Three cleaning modes: Auto mode for a whole home clean, Edge mode for corners and under kitchen counters and Spot mode for entryways and around litter boxes for a concentrated clean.", "Anti-scratch brushroll: Specially designed to protect your hard floors yet also clean carpet using a combination of specially angled soft bristle brushes and flexible rubber blades.", "Excellent climbing ability: The GrooveGear climbing wheels make an easy transition from hard floor to carpet and over door thresholds."], "description": "Get in the groove(s) with Eureka's Groove robotic vacuum cleaner! 2, 000Pa of suction power make it perfect for day-to-day maintenance to keep pet fur, dust, dirt and debris from building up. The robot's slim design allows it to get to hard to reach areas under furniture and its specially designed GrooveGear wheels help it easily transition from hard floor to carpet and move between rooms. With three cleaning modes and four ways to control, convenient, easy cleaning can now be done simply at the touch of a button.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 7, "totalReviews": 493, "uuid": "755470f4-4c6d-4a79-b637-8bf31206c1f6", "image": "https://images-na.ssl-images-amazon.com/images/I/41kzHd37DXL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07D78Y5TN", "isPrime": "false", "url": "https://www.amazon.com/dp/B07D78Y5TN", "title": "eufy by Anker, BoostIQ RoboVac 30, Robot Vacuum Cleaner, Upgraded, Super-Thin, 1500Pa Suction, Boundary Strips Included, Quiet, Self-Charging Robotic Vacuum, Cleans Hard Floors to Medium-Pile Carpets", "price": 239.99, "category": "Home & Kitchen", "bsr": 36437, "soldByAmazon": "false", "rating": 4.4, "isFba": "true", "aboutBullets": ["Worry-Free Cleaning: Set Boundary Strips and the slim 2.85\" body with an upgraded 1500Pa only cleans the areas you want.", "BoostIQ Technology: Automatically increases suction power within 1.5 seconds when extra vacuuming strength is needed to get the best clean.", "A Quiet Clean: A Quiet Clean: Vacuums for up to 100 minutes on hardwood floors with a consistent, powerful suction at a volume no louder than a microwave.", "Premium Features: Anti-scratch tempered glass-top cover for protection, infrared-sensor for evading obstacles, and drop-sensing tech to avoid falls. Automatically recharges so it's always ready to clean.", "What You Get: RoboVac 30, 13 ft Boundary Strips, remote control (2 AAA batteries included), charging base, AC power adapter, cleaning tool, extra set of high-performance filters, 4 side brushes, 5 cable ties, welcome guide, and our worry-free 12-month warranty."], "description": "", "hasBuyBox": "true", "soldBy": "EufyHome", "sellers": 11, "totalReviews": 3840, "uuid": "dfa7b20d-94c3-4fea-91b3-904ab028363a", "image": "https://images-na.ssl-images-amazon.com/images/I/51HKzUKTXRL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1U62USFOR8NN3&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00FDOONEC", "isPrime": "false", "url": "https://www.amazon.com/dp/B00FDOONEC", "title": "Weber 50060001 Q1000 Liquid Propane Grill,Chrome", "price": 179.0, "category": "Home & Kitchen", "bsr": 4137, "soldByAmazon": "true", "rating": 4.8, "isFba": "true", "aboutBullets": ["One stainless steel burner produces 8500 BTU-per-hour to heat 189 square-inch total cooking area", "Porcelain-enameled cast-iron cooking grates and cast aluminum lid and body", "Fully assembled out of box. Dimensions - lid closed (inches): 14.5H x 27W x 16.5D inches", "Push-button ignition and infinite control burner valve settings. Fuel type - Liquid Petroleum Gas (disposable cartridge sold separately)", "Uses disposable 14.1 or 16.4 oz. LP cylinder (sold separately). Grill must be preheated with burner on high for 10 to 15 minutes"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 14, "totalReviews": 1947, "uuid": "af57de54-a318-4ea9-b15c-2e978b388033", "image": "https://images-na.ssl-images-amazon.com/images/I/41yLW9ky7KL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07K14KBVR", "isPrime": "false", "url": "https://www.amazon.com/dp/B07K14KBVR", "title": "Char-Broil 19202101 Deluxe Black Digital Electric Smoker, Large, 725 Square Inch", "price": 199.84, "category": "Home & Kitchen", "bsr": 3622, "soldByAmazon": "true", "rating": 4.4, "isFba": "true", "aboutBullets": ["Insulated, double-wall construction", "Advanced control panel with easy-read, blue LED display", "Removable food thermometer", "Glass door allows you to monitor the smoke without opening the door", "Large, steel locking latch for smoke-tight seal", "Corded electric", "Remote control not included, (Only with deluxe stainless steel model)"], "description": "An exclusive, The Char-Broil digital electric black smoker deluxe is the perfect smoker for those who want to enjoy delicious smoked foods, but don't have the time to tend to a live Fire for hours on end. With it's user-friendly & intuitive digital display & integrated temperature probe, you simply program the unit to smoke your food to a desired internal Temperature, & then once there, the unit will keep your food warm until it is removed & ready to be served. Offers a whopping 725 sq. In. Of cooking space over four different cooking grates- more than enough space to cook for a party of 8 or more! Insulated double wall construction makes the Char-Broil electric smoker 10 times more efficient with the wood chips - meaning you can fill the box Once compared to 10 times with the leading electric smoker & still get the same amount of smoke. Features a large latched door with Glass window so that you can monitor progress without opening the door, as well as air dampers & an Advanced control panel with easy-read, blue LED display. The integrated temperature probe can be removed & cleaned when not in use, & a high-capacity grease tray located under the smoker easily slides out for grease removal & cleanup. & with the Char-Broil large capacity smoke box, you'll get 4 to 7 hours of smoke before needing to refill, which means more time spent with friends, family & guests. Measures 18 1\" W x 16 5\" D x 32 5\" H & weighs 50 2lbs.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 1, "totalReviews": 229, "uuid": "d2b1160a-814e-46df-8ced-df415d52ff2b", "image": "https://images-na.ssl-images-amazon.com/images/I/41Qy6i0EoIL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B00I0BVQFO", "isPrime": "false", "url": "https://www.amazon.com/dp/B00I0BVQFO", "title": "4moms rockaRoo Baby Swing | Compact Baby Rocker with Front to Back Gliding Motion | Smooth, Nylon Fabric | Grey Classic", "price": 159.99, "category": "Home & Kitchen", "bsr": 3096, "soldByAmazon": "true", "rating": 4.3, "isFba": "true", "aboutBullets": ["Front to back gliding motion", "Compact size; 1/3 the size of traditional swings", "5 speeds", "MP3 compatible", "Toy mobile with reversible, removable toys", "Easy to remove, machine washable seat", "3-point harness"], "description": "BIG Motion, small size. The 4moms rockaRoo provides front to back gliding motion that babies love in a compact size. The smooth gliding motion of the rockaRoo soothes your baby like you do when comforting them in your nursery glider or rocking chair. It's sleek, modern design is one third the size of traditional swings so the rockaRoo looks great in your home! The new 4moms rockaRoo features a cool mesh fabric with a soft, breathable surface to maximize airflow and keep baby cool and comfortable. The rockaRoo is designed with a back layer consisting of a 3D air mesh fabric that provides enhanced breathability and airflow, while the front layer is a smooth, nest-knit fabric that provides cooling comfort. The updated design features fresh and modern colors. The overhead toy mobile reflects these updated colors with reversible, removable toy balls to keep baby entertained.", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 1, "totalReviews": 667, "uuid": "8b4dce49-aa7a-46d8-9f97-60599c2ad8a5", "image": "https://images-na.ssl-images-amazon.com/images/I/31TAAM5Ef6L.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B01MAW2294", "isPrime": "false", "url": "https://www.amazon.com/dp/B01MAW2294", "title": "Google WiFi system, 3-Pack - Router Replacement for Whole Home Coverage (NLS-1304-25),White", "price": 279.0, "category": "Home & Kitchen", "bsr": 2369, "soldByAmazon": "false", "rating": 4.6, "isFba": "true", "aboutBullets": ["A new type of connected system for seamless WiFi coverage throughout your home, helping eliminate dead zones and buffering", "Replaces your current router, and works your modem and internet service. It's compatible with major internet service providers including Comcast, Time Warner, and Verizon Fios", "A single WiFi point covers up to 1,500 square feet, a set of three covers homes up to 4,500 square feet Wifi points work together so you can add more if you need additional coverage", "Network Assist technology keeps your connection fast by always selecting the clearest channel and fastest band for your devices", "A simple app gets you set up quickly and allows you to see what's connected, prioritize devices, and pause the WiFi on kids devices. Family controls allow you to pause the WiFi on kids devices, like during"], "description": "", "hasBuyBox": "true", "soldBy": "E ZEE ELECTRONICS", "sellers": 26, "totalReviews": 13590, "uuid": "4a794cc8-7ecf-4a3e-ba2a-929ec7f35cc8", "image": "https://images-na.ssl-images-amazon.com/images/I/212yuX23jeL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1LLZOUM6C4EQT&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00NGV4E1G", "isPrime": "false", "url": "https://www.amazon.com/dp/B00NGV4E1G", "title": "Nutri Ninja Personal and Countertop Blender with 1200-Watt Auto-iQ Base, 72-Ounce Pitcher, and 18, 24, and 32-Ounce Cups with Spout Lids (BL642)", "price": 159.99, "category": "Home & Kitchen", "bsr": 8169, "soldByAmazon": "true", "rating": 4.7, "isFba": "true", "aboutBullets": ["Auto IQ technology features timed, intelligent blending programs that do the work for you, no guesswork required", "Xl 72 ounce total crushing blender pulverizes ice to snow in seconds for creamy frozen drinks and smoothies", "Nutri Ninja Pro extractor blades break down whole fruits, vegetables, ice and seeds for maximum nutrient & vitamin extraction", "Small, regular, and jumbo multi serve nutri ninja cups with sip & seal lids for nutrient rich super juices on the go", "1200 watts/2 hp of professional performance power"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 9, "totalReviews": 3252, "uuid": "8822d056-353f-48c9-bc50-65e68d11e524", "image": "https://images-na.ssl-images-amazon.com/images/I/41X9FCPnrfL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07F3TNCMK", "isPrime": "false", "url": "https://www.amazon.com/dp/B07F3TNCMK", "title": "Pioneer DJ DJ Controller (DDJ-400)", "price": 249.0, "category": "Home & Kitchen", "bsr": 542, "soldByAmazon": "true", "rating": 4.8, "isFba": "true", "aboutBullets": ["Club Style layout similar to that of the CDJ-2000NXS2 and DJM-900NXS2", "Built in sound card with plug and play connectivity via USB cable", "Includes Rekordbox DJ license key", "New Features of Rekordbox Ver 5.3 - Tutorial feature to help learn how to DJ", "Frequency Range: 20 - 20000 Hz. Software System Requirements-Mac- macOS Mojave 10.14 (Updated to the latest version), macOS High Sierra 10.13 (Updated to the latest version), macOS Sierra 10.12 (Updated to the latest version), OS X 10.11 (Updated to the latest version). Windows- Windows 10/ 8.1/ 7 (latest service pack)"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 25, "totalReviews": 964, "uuid": "82e838b8-cf27-48f0-b862-3ccd2f76ad0c", "image": "https://images-na.ssl-images-amazon.com/images/I/51XWSygjI-L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B07B3LR8JB", "isPrime": "false", "url": "https://www.amazon.com/dp/B07B3LR8JB", "title": "Miele Complete C2 Hard Floor Canister Vacuum Cleaner with SBD285-3 Rug and Floor Tool + SBB400-3 Twister XL Floor Brush", "price": 449.0, "category": "Home & Kitchen", "bsr": 27750, "soldByAmazon": "false", "rating": 4.7, "isFba": "true", "aboutBullets": ["1,200 watt Miele-made Vortex Motor | Gentle on sensitive hard floors - soft parquet brush | Adjustable working height - Stainless steel telescopic tube | Effortless vacuuming of larger areas with 33' operating radius", "6-setting suction control via Rotary Dial | Exclusive Miele AirClean Sealed System | Type GN AirClean FilterBag, 4.76 quart | AirClean Filter (SAC 20/30) | Pure Suction Combination Floorhead (SBD 285-3) | Pure Suction Parquet Twister XL Floorhead (SBB 400-3) | Integrated Dusting Brush, Upholstery Tool and Crevice Tool | 33' cleaning radius", "Electronic suction power setting: 6-stage rotary selector | Ergonomic carrying handle | Ergonomic handle Comfort handle | Park system for vacuuming breaks | Castor wheels gentle on floors | Three-point maneuverability | Locking system for floor head and handle | Automatic FilterBag positioning", "Electronic suction power setting: 6-stage rotary selector | Ergonomic carrying handle | Ergonomic handle | Comfort handle | Park system for vacuuming breaks", "Type of FilterBag| GN AirClean FilterBag | FilterBag volume: 4.75qt | Exhaust filter: AirClean Filter (SAC 20/30) | Manufacturer Warranty: 3 Year Parts and Labor"], "description": "", "hasBuyBox": "true", "soldBy": "Better Home NJ", "sellers": 9, "totalReviews": 685, "uuid": "4269956d-7f55-4cb5-ba5d-b7d0e0938714", "image": "https://images-na.ssl-images-amazon.com/images/I/51S%2BrkFPn0L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A34NTJ7Q89G2YI&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01N4BI77I", "isPrime": "false", "url": "https://www.amazon.com/dp/B01N4BI77I", "title": "Dyson Upright Vacuum Cleaner, Ball Animal 2, Iron/Purple", "price": 491.55, "category": "Home & Kitchen", "bsr": 13299, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["Strongest suction of any vacuum; Even more power for tough tasks", "Self-adjusting cleaner head seals in suction across carpet, wood, vinyl, and tile floors", "Tangle free turbine tool, stair tool, combination tool included", "Whole-machine filtration ensures that allergens are trapped inside the machine, not expelled back into the home.", "Hygienically empty the bin with the push of a button"], "description": "", "hasBuyBox": "true", "soldBy": "Triplenet Pricing INC", "sellers": 13, "totalReviews": 3881, "uuid": "2ff3b9f0-6c12-4d1f-91f4-22ce4a24a57e", "image": "https://images-na.ssl-images-amazon.com/images/I/31ggjhHCjkL._AC_.jpg", "variations": {"sizes": ["Animal 2 - Total Clean", "Ball Animal 2"], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2BKMVDZSSY34W&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B01ID8H6NO", "isPrime": "false", "url": "https://www.amazon.com/dp/B01ID8H6NO", "title": "iRobot Roomba 960 Robot Vacuum- Wi-Fi Connected Mapping, Works with Alexa, Ideal for Pet Hair, Carpets, Hard Floors,Black", "price": 499.99, "category": "Home & Kitchen", "bsr": 19688, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["POWERFUL PERFORMANCE AND POWERFUL PICK-UP - Power-Lifting Suction delivers 5X the air power for improved pick-up performance.", "IT WON'T STOP TILL THE JOB IS DONE - Intelligently maps & cleans an entire level of your home. Patented iAdapt technology with vSLAM navigation actively captures thousands of precise measurements each millisecond to optimize coverage.", "NAVIGATES IN NEAT ROWS - Purposefully & logically cleans in neat rows & uses floor tracking sensors to navigate your home.", "IDEAL FOR HOMES WITH PETS - Unique Dual Multi-Surface Rubber Brushes don't get tangled with pet hair. Brushes adjust & flex to stay in constant contact with carpets & hard floors. High-Efficiency Filter traps 99% of cat & dog allergens.", "LEARNS YOUR LIFE LISTENS TO YOUR VOICE - Learns your cleaning habits to offer up personalized schedules, while Google Assistant & Alexa allow you to start cleaning with just the sound of your voice.", "SENSES & ELIMINATES DIRT - Dirt Detect Sensors alert your robot about dirtier areas of your home, like high-traffic spots, & cleans them more thoroughly.", "THE DREAM TEAM OF CLEAN - With Imprint Link, when the Roomba 960 finishes vacuuming, it automatically tells Braava jet m6 to start mopping."], "description": "The Roomba 960 robot vacuum seamlessly navigates room to room to clean an entire level of your home, recharging and resuming until the job is done. Roomba 960 loosens, lifts, and suctions dirt with up to 5x more air power and requires less maintenance. Just press CLEAN or schedule Roomba on the go with the iRobot HOME App.", "hasBuyBox": "true", "soldBy": "ARF Tech", "sellers": 17, "totalReviews": 7457, "uuid": "41bdb04a-fd37-48ad-aff3-e9261c126aad", "image": "https://images-na.ssl-images-amazon.com/images/I/41v2Jx9jFkL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A2MV12Q2RN4X4S&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B002Z9GDYG", "isPrime": "false", "url": "https://www.amazon.com/dp/B002Z9GDYG", "title": "Great Northern Popcorn Red Matinee Movie Theater Style 8 oz. Ounce Antique Popcorn Machine", "price": 179.99, "category": "Home & Kitchen", "bsr": 1545, "soldByAmazon": "true", "rating": 4.5, "isFba": "true", "aboutBullets": ["3 position control switch and 860-watts", "Tempered glass (all glass). Reject kernel tray", "Works on standard 110-volt, Premium paint and enhanced colors Safer Packing", "Machine is LxWxH = 14.4 x 13.6 x 22.8(inches) . Makes roughly 2-3 gallons of popcorn per batch", "3-year warranty on the machine and a 30 day limiited warranty on all consumable parts including kettles and/or light bulbs. Note : Refer to the PDF attached below in Technical Specification for Installation Manual."], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 4, "totalReviews": 2629, "uuid": "12c28b68-08e7-4eac-ac3f-ac01f3d37bb1", "image": "https://images-na.ssl-images-amazon.com/images/I/51lMN2TrkGL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Red"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B00QZ5CV10", "isPrime": "false", "url": "https://www.amazon.com/dp/B00QZ5CV10", "title": "Margaritaville DM0700-000-000 Frozen Concoction Maker, 1, White", "price": 199.99, "category": "Home & Kitchen", "bsr": 8276, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["The Bahamas Frozen Concoction Maker with 36-ounce blending jar is an easy-to-use margarita machine that lets you easily create pitchers full of fun, tropics-inspired party drinks", "Machine features the No-Brainer mixing tool with measurements for making pina coladas, daiquiris, and margaritas. 400-watts of combined shaving & blending power", "Automatic shave 'n blend cycle mixes the right proportion of ice with ingredients; manual blend only/shave only cycles", "Easy-Pour Jar allows you to mix your concoction, then just pop open the hatch and pour it", "Measures approximately 14 x 9 x 18 inches; ice reservoir holds ice for a full pitcher; 1-year limited warranty; dishwasher-safe parts"], "description": "Nothing captures that festive, casual islands attitude quite like a Margaritaville Bahamas Frozen Concoction Maker. Gather friends together and keep the icy cold, delicious drinks flowing. Put this margarita machine on \"shave 'n blend,\" and it automatically churns out a full, 36-ounce pitcher of frozen drinks as good as any you'll ever get in a restaurant. If you want to put your own spin on a concoction, use the custom \"shave only\" or \"blend only\" setting to customize ice or ingredients. You'll be sipping on a slice of paradise in no time. The party's always better with the Bahamas Frozen Concoction Maker.", "hasBuyBox": "true", "soldBy": "VM Express", "sellers": 11, "totalReviews": 842, "uuid": "f02f4239-e1be-47ab-8bee-9f63caef6744", "image": "https://images-na.ssl-images-amazon.com/images/I/41IKFDlq49L._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A1DXN92KCKEQV4&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B083QW2J1Z", "isPrime": "false", "url": "https://www.amazon.com/dp/B083QW2J1Z", "title": "Yobest Baby Playpen, Extra Large Play Yard for Infants, Sturdy Safety Infant Playard, Indoor and Outside Big Toddler Play Pen with Gates, Portable Babys Fences for Babies, Infant, Kids, Childs", "price": 169.0, "category": "Home & Kitchen", "bsr": 4750, "soldByAmazon": "false", "rating": 4.7, "isFba": "true", "aboutBullets": ["ENJOY LARGE PLAYING AREA: Childs play yard size is 75x59x27inch/190x150x70cm, the internal size is 72x56x27inch/184x141x70cm, with plenty of room for toys, friends, or pets, and ample space to move around, your little one will love his new play area. Note: The product does not contain ocean balls.", "SAFETY ECO-FRIENDLY MATERIAL & NON-SLIP: Baby playpen fence is made of Resistant-duty oxford material & strong fabrics net sidings, BPA free, easy clean, simply hand wash and wipe down with a damp cloth and soap to keep it fresh and sanitary. the non-slip suction cups on the bottom of the panel makes it difficult to tip over and move.", "BREATHABLE MESH & SAFETY LOCK: Large playpen sides panels are a visible soft breathable mesh, Interact at any time to give your baby a sense of security and external zipper to prevent baby from running accidentally and falling accidentally.", "EASY TO ASSEMBLE: Playpen for toddler use alloy steel pipe and plastic joint connection, easy to disassemble and assemble(no tools required). We have detailed the installation steps in the manual, please read the installation instructions carefully before proceed.", "MOMMY LIFE SAVER: YOBEST infant play yard can effectively help your kids explore the world of perception, keep your baby away from harm, and mothers can free their hands to do their own things.If you have any questions, please contact us first. We will reply to you within 8 hours until you are satisfied."], "description": "", "hasBuyBox": "true", "soldBy": "YOBEST", "sellers": 0, "totalReviews": 391, "uuid": "57502271-2c9d-42af-9fa2-e7f4317dd068", "image": "https://images-na.ssl-images-amazon.com/images/I/51rMbE47alL.jpg", "variations": {"sizes": [], "colors": ["Green", "Grey"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3L9M1OBKY5IC4&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B00DQC9HRG", "isPrime": "false", "url": "https://www.amazon.com/dp/B00DQC9HRG", "title": "Cosco Vinyl Folding Chair, 4 Pack, Black", "price": 69.7, "category": "Home & Kitchen", "bsr": 5974, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["Folds flat and compact for easy storage", "Durable steel frame with powder-coated durable finish", "Cross braces and tube-in-tube reinforced frame for strength and stability", "Non-marring leg tips protect floor surfaces. Height: 29.92 , width: 18.425, depth:18.5 inches"], "description": "Make your hosting duties easier with durable, comfortable chairs that clean up in a breeze. In antique linen with a powder-coated finish for durability. The vinyl padded seat and back make them a crowd favorite. This folding chair offers a tube-in-tube reinforced frame and low maintenance, long lasting powder coat frame finish, while still remaining stylish with fashionable vinyl upholstery that matches any current decor. Chairs have a strong, two cross brace construction and a comfortable, contoured padded seat and back.", "hasBuyBox": "true", "soldBy": "Vanquish Sales", "sellers": 50, "totalReviews": 2978, "uuid": "596ddee2-1c9b-491c-ad78-e2d4e94b9469", "image": "https://images-na.ssl-images-amazon.com/images/I/41iid1nwuOL._AC_.jpg", "variations": {"sizes": ["2 Pack", "4 Pack"], "colors": ["Antique Linen", "Black"], "patter_name": ["Folding Chair", "Folding Chair + Folding Table"], "style_name": ["Folding Chair", "Folding Chair + Folding Table"]}, "soldByStoreLink": "https://www.amazon.com/s?me=A2LTHTG85UTRLQ&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00WNNYSJG", "isPrime": "false", "url": "https://www.amazon.com/dp/B00WNNYSJG", "title": "UltraHD Tall Storage Cabinet - Stainless Steel", "price": 244.49, "category": "Home & Kitchen", "bsr": 10672, "soldByAmazon": "false", "rating": 4.6, "isFba": "false", "aboutBullets": ["Set of 4 5\" Wheels (2 wheels with brakes) included", "Stainless Steel Segmented Doors", "Dimensions: 36\" W x 18\" D x 72\" H", "Weight Capacity: 600 lbs total, 150 lbs for each shelf", "Powder Coated Steel Frame"], "description": "Revamp any space in your home with this UltraHD Storage Cabinet! Store all your tools and supplies securely and in style. Conveniently adjust the shelves to your specific needs. These cabinets feature quality powder-coated construction, stainless steel segmented doors, and high-quality wheels and hardware to provide an economical but great-looking answer to your garage organization project.", "hasBuyBox": "true", "soldBy": "Nitro-Mart", "sellers": 35, "totalReviews": 856, "uuid": "851ac145-f984-4c9f-90a8-9fa975e9e213", "image": "https://images-na.ssl-images-amazon.com/images/I/41mDM8dtwPL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A3TY26U2YKL6LL&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0736T5F16", "isPrime": "false", "url": "https://www.amazon.com/dp/B0736T5F16", "title": "Wingback Recliner Chair Leather Single Modern Sofa Home Theater Seating for Living Room (Black)", "price": 109.99, "category": "Home & Kitchen", "bsr": 8126, "soldByAmazon": "false", "rating": 4.3, "isFba": "false", "aboutBullets": ["[(EASY ADJUSTMENT AND ULTIMATE RELAXATION)] Sit back and relax in your very own push back recliner chair. This club chair features a dual-function foot extension and a reclining back that will surely help you to unwind and de-stress.Enjoy your favorite entertainment and fully relax your body and mood with this comfortable recliner sofa.recliner chair reliner sofa club chair", "[(DURABLE AND EASY TO CLEAN)] Our recliner chair is upholstered with durable PU,when water spills onto the recliner sofa , it is very waterproof and clean.The legs and frame of this recliner sofa are engineered from solid hardwood to provide added stability and durability.reliner sofa club chair recliner chair", "[(JUST TWO MINUTES TO INSTALL)]  Our recliner sofa is easy to install,Only takes 2 minutes to install,just slip the back part of the club chair onto the base and screw four legs,then you're complete! No tools required!If you have any problem with our club chair ,please feel free to contact us.club chair recliner chair single sofa", "[(Widely Use)] This club chair can be used not only in home but also in pub and other business place for its sophisticated look and excellent sunlight resistance.Our recliner chair will accompany you and your family and friends. Everyone will be asking for a turn to relax in this recliner sofa of yours.single sofa club chair recliner chair", "[(MODERN AND CLASSIC DESIGN)] This recliner chair is sleek, modern and sophisticated. Expertly crafted for style, this club chair can be the perfect accent for the living room or the office.Our recliner sofa will decorate your decor.recliner chair reliner sofa single sofa"], "description": "", "hasBuyBox": "true", "soldBy": "Cavalier Store", "sellers": 5, "totalReviews": 3323, "uuid": "28ebd7f5-333c-428f-af5e-b6861e6974e0", "image": "https://images-na.ssl-images-amazon.com/images/I/31cCESypFKL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Blue", "Brown", "Fabric Beige", "Grey", "Tan"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3MXV3BRX5P67N&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07VVF6R5L", "isPrime": "false", "url": "https://www.amazon.com/dp/B07VVF6R5L", "title": "Medify Air MA-14-W2 Air Purifier with H13 HEPA filter - a higher grade of HEPA for for 200 Sq. Ft. (99.9%) Allergies, dust, Pollen, Perfect for Office, bedrooms, dorms and Nurseries - White, 2-Pack", "price": 180.0, "category": "Home & Kitchen", "bsr": 2464, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["A higher grade of HEPA - H13 Filters (higher rated than True HEPA) 99.9% particle removal.", "CADR of 120 | Cleans up to 470 sq. ft.in an hour. 200 sq. ft. in 30 minutes. 117 sq. ft. in 15 minutes | Perfect for Office, Bedroom, Dorms, Baby Nurseries", "3 Fans Speeds | Night Light | Sleep Mode", "Filter Replacement indicator | Replacement Filter ASIN B081938T3X", "110 Volt units, Lifetime coverage"], "description": "", "hasBuyBox": "false", "soldBy": "Medify Air", "sellers": 1, "totalReviews": 2001, "uuid": "80a23056-2937-4bab-b524-a3af116aab40", "image": "https://images-na.ssl-images-amazon.com/images/I/41qwwIeDhzL._AC_.jpg", "variations": {"sizes": ["1-Pack", "2-Pack"], "colors": ["Black", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A32M9WIF92ZF3R&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "true"},
{"asin": "B01N7I2U5F", "isPrime": "false", "url": "https://www.amazon.com/dp/B01N7I2U5F", "title": "GTRACING Gaming Chair Racing Office Computer Game Chair Ergonomic Backrest and Seat Height Adjustment Recliner Swivel Rocker with Headrest and Lumbar Pillow E-Sports Chair Blue", "price": 159.0, "category": "Home & Kitchen", "bsr": 8660, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["PERFECT FOR GAMING: GTRACING is dedicated to make the best gaming chair for pro gamers. Choose us, and improve your gaming experience! Dimensions: 20.86\"(L) x 21.26\"(W) x 48.82\"-51.97\"(H); Sitting Area Dimensions: 16''(L) x 19.68''(W); Maximum Weight Capacity: 300 pounds.", "ERGONOMIC DESIGN: Strong metal frame designed to help promote a comfortable seated position, keeping you comfy after long hours of game or work. Thick padded back & seat take this chair to the next level of comfort.", "MULTI-FUNCTION: Armrest and seat-height adjustable; 90~170degreclining and rocking; 360degswivel; 5-point base built with heavy duty; Smooth-rolling casters; Removable headrest pillow and lumbar cushion.", "HIGH-QUALITY MATERIAL: Smooth PU leather, added seat cushion, and lumbar & headrest pillows offer added support and comfort. Heavy-duty base and nylon smooth-rolling casters for great stability and mobility.", "WIDE APPLICATIONS: GTRACING gaming chair is an ideal seat of choice for working, studying and gaming. It will make your space more modern and elegant,and make you more comfortable."], "description": "", "hasBuyBox": "true", "soldBy": "GTRACING Direct", "sellers": 0, "totalReviews": 3452, "uuid": "c2f5680f-5a2a-46f8-96a8-915d60d90950", "image": "https://images-na.ssl-images-amazon.com/images/I/41xEsCcQfdL._AC_.jpg", "variations": {"sizes": [], "colors": ["Blue", "Gray", "Green", "Pink", "Purple", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A25EMYIGO0RE3E&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00DD1UQ3Y", "isPrime": "false", "url": "https://www.amazon.com/dp/B00DD1UQ3Y", "title": "DEWALT 18/20V Max Vacuum, Wet/Dry (DCV581H)", "price": 144.0, "category": "Home & Kitchen", "bsr": 4504, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Can operate corded with an AC outlet, or cordless by an 18v or 20v MAX battery", "HEPA Rated filter traps up to 99.97 percent efficiency", "Washable/reusable filter;2 Gallon tank capacity. 31 CFM", "Crush resistant 5ft hose.Heavy duty, crush resistant, fully integrated 5' (by 1 1/4\" diameter) hose provides durability, flexibility and ease of use", "On board storage for easy transport.Longest life and best performance can be obtained if the battery pack is charged when the air temperature is between 65degF and 75degF(18deg-24degC)"], "description": "The DEWALT DCV581H 18/20v MAX* Cordless/Corded Wet-Dry Vacuum has the ability to provide cordless or corded operation powered by either an 18v or 20v MAX battery or an AC outlet. It features a HEPA rated wet/dry filter that traps dust with 99.97% efficiency at 1 micron. The filter is easily accessible, washable/reusable (use tap or water rinse to clean). This unit has a heavy-duty crush-resistant fully integrated 5' (by 1-1/4\" diameter) hose which provides durability, flexibility and ease of use. The on-board hose and accessory storage makes the vacuum easy to carry and transport. Also comes with a crevice tool attachment and a wide nozzle tool attachment. Battery and charger sold separately.", "hasBuyBox": "true", "soldBy": "Toolup", "sellers": 3, "totalReviews": 3112, "uuid": "3b200d7a-e5e0-4840-a637-a4dbed9e5813", "image": "https://images-na.ssl-images-amazon.com/images/I/41Ne7lldrjL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3492A4RFALDQG&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07FXH81ZT", "isPrime": "false", "url": "https://www.amazon.com/dp/B07FXH81ZT", "title": "Storage Metal Shelf Wire Shelving Unit with Wheels 82\"x48\"x18\" Sturdy Steel Heavy Duty 6 Tier Layer Rack with Casters for Restaurant Garage Pantry Kitchen Garage Rack Black", "price": 158.0, "category": "Home & Kitchen", "bsr": 3716, "soldByAmazon": "false", "rating": 4.7, "isFba": "false", "aboutBullets": ["[(Easy to Assemble)] : No assembly tool is needed, it can be assembled freely, metal storage rack and the height of each layer can be adjusted, which can be adjusted to the height or level you want, the operation is very simple. Storage shelf metal rack wire unit", "[(Broad Usage)] The super storage function metal storage rack can be placed in kitchens, bathrooms, rooms, living rooms, warehouses, offices, industrial, commercial exhibitions, hotels, supermarkets, etc. Metal shelf unit storage rack wire", "[(Extremely Durable)] Made of heavy steel, it has excellent rust resistance and oxidation resistance. Storage rack the weight limit of each shelf is 350 pounds, and the total weight limit of the whole shelf is 2100 pounds when equally distributed on feet levelers. Wire unit rack shelf metal storage.", "[(Convenient Wheel)] The wheels of the shelves are equipped with fixed locks that can be fixed or moved at any time. For example, you can unlock when you need to push the metal storage rack clean or push it into a sunny place. If you want to secure the heavy metal shelf in place, you can lock the lock. Rack wire shelf storage unit metal", "[(What You Will Got)] We guarantee that you will like this metal storage rack. If you are not satisfied with this storage rack, please contact us! If you have any questions, please feel free to ask! Perfect Christmas and Thanksgiving gift for your friends and relatives."], "description": "", "hasBuyBox": "false", "soldBy": "VikBel", "sellers": 2, "totalReviews": 2223, "uuid": "a3c2b8de-e19e-4a50-bc5c-d60ccdc19d9d", "image": "https://images-na.ssl-images-amazon.com/images/I/51odbsjpHzL._AC_.jpg", "variations": {"sizes": ["82 Inch Height", "82 Inch High"], "colors": ["Black", "Chrome"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A302AJ9HEJ8AG7&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07PBQ22PP", "isPrime": "false", "url": "https://www.amazon.com/dp/B07PBQ22PP", "title": "KitchenAid KSM180QHSD 100 Year Limited Edition Queen of Hearts Stand Mixer, Passion Red", "price": 399.99, "category": "Home & Kitchen", "bsr": 10595, "soldByAmazon": "true", "rating": 4.8, "isFba": "true", "aboutBullets": ["Passion red embodies the energy, strength and passion to create possibility in the kitchen", "Passion-inspired trim band with hundreds of miniature red hearts, sleek chrome accents and a custom chrome power hub cover celebrating 100 years of the KitchenAid brand", "5 quart stainless steel bowl with handle to mix up to 9 dozen cookies in a single batch", "10 Speeds, powerful enough for nearly any task or recipe", "Over 14 different attachments available to make everything from fresh pasta to burgers, veggie noodles and more", "Tilt-head design for clear access to the bowl to add ingredients for a recipe", "59 Touch points around the bowl ensure that all ingredients are thoroughly incorporated", "Includes (1) coated flat beater, (1) coated c-dough hook, (1) 6-wire whip (1) one-piece pouring shield"], "description": "", "hasBuyBox": "true", "soldBy": "Amazon.com", "sellers": 1, "totalReviews": 251, "uuid": "e11a052a-640f-4880-8635-2894b1843d73", "image": "https://images-na.ssl-images-amazon.com/images/I/41Opyz2hM9L._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.Amazon.com", "isSellerNameInProductName": "false"},
{"asin": "B077JBQZPX", "isPrime": "false", "url": "https://www.amazon.com/dp/B077JBQZPX", "title": "Fellow Stagg EKG, Electric Pour-over Kettle For Coffee And Tea, Matte Black, Variable Temperature Control, 1200 Watt Quick Heating, Built-in Brew Stopwatch", "price": 138.34, "category": "Home & Kitchen", "bsr": 9533, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["SIMPLE AESTHETIC MEETS POWERFUL DESIGN: Finally, an electric pour-over kettle that pours as good as it looks. The Stagg EKG Electric Pour-Over Kettle marries handsome design with flawless functionality for the ultimate brewing experience. Modern and minimal to complement your other kitchenware. Proudly designed in California. Want to see the temperature in Celsius instead of Fahrenheit? Just switch the temperature toggle on the rear of the base", "PRECISION ENGINEERING: Stagg EKG's precision pour spout is designed for the optimal pour-over flow rate. With its fluted tip, Stagg EKG has to-the-drop precision with no drip back. Stagg EKG's counterbalanced handle moves the center of mass back towards your hand - encouraging a more comfortable, slower pour. To speed up your brewing process, Stagg EKG has a 1200 watt quick heating element. Switch the toggle on the back to HOLD mode, and Stagg EKG will maintain the desired temp for 60 minutes.", "VARIABLE TEMPERATURE CONTROL: Did you know that freshly roasted coffee should be brewed at a higher temperature than an older bag of beans? Bean, roast, grind size, and brew method all factor into your brewing temp, and with Stagg EKG, you have to-the-degree control. By turning the dial, you select your temperature ranging from 135degF to 212degF. Even Different types of tea require different temperatures, Stagg EKG's variable temperature control makes steeping the perfect cup of tea easy.", "BREW LIKE A PRO: Used in barista competitions across the US, Stagg EKG makes brewing like a pro easy. A sleek LCD screen indicates the desired \"Set Temp\" and \"Real Time Temp\" with an illuminating element to show the heating progress. After the water has heated, use Stagg EKG's built-in Brew Stopwatch to time your extraction. Ever wonder about those flavors listed on the bag to describe coffee? Use the right tools like Stagg EKG, and you'll coax out taste notes like cherry and citrus.", "FULL 1-YEAR WARRANTY AND OUTSTANDING CUSTOMER SERVICE: Fellow Industries Inc. warrants this product against any defects that are due to faulty material or workmanship for a one-year period after the original date of consumer purchase. Fellow has made customer service and experience one of our number one priorities. We're proud of our fast response times and we will do whatever it takes to make sure you are satisfied with your purchase."], "description": "", "hasBuyBox": "true", "soldBy": "US Supply Market", "sellers": 10, "totalReviews": 1499, "uuid": "af9d3c11-ba12-491b-b9b6-8e16bf48d798", "image": "https://images-na.ssl-images-amazon.com/images/I/31t94YDDtyL._AC_.jpg", "variations": {"sizes": ["EKG (0.9L)"], "colors": ["Matte Black", "Polished"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3RBPOBGDPLZP8&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B073ZJWHH3", "isPrime": "false", "url": "https://www.amazon.com/dp/B073ZJWHH3", "title": "HOMCOM 72\" Traditional Colonial Kitchen Pantry Cabinet with 2 Large Storage Areas, Drawer, and Adjustable Shelves, White", "price": 299.99, "category": "Home & Kitchen", "bsr": 10692, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["TRADITIONAL COLONIAL AESTHETIC: This elegant colonial cabinet becomes a functional centerpiece in any room, adding charm and whimsy along with ample storage and display space.", "ADJUSTABLE SHELVING: Three adjustable shelves allow for a variety of different sized items to be stored within the cabinet, or remove all of the shelves to create a single large display alcove.", "LARGE STORAGE DRAWER: A large central drawer is perfect for storing silverware, knick-knacks, towels, or other household items that you want to be accessible while still hidden away.", "DURABLE AND STABLE: Constructed from durable P2 grade engineered wood with a reinforced backboard and wall attachments for stability, this cabinet can be used daily as kitchen, bedroom, or bathroom storage.", "VERSATILE STYLE: This cabinet, with its stark lines and solid block color, will fit with most decor and will enhance the look of bedrooms, bathrooms, kitchens, or hallways while adding a functional storage option."], "description": "", "hasBuyBox": "true", "soldBy": "Aosom Direct", "sellers": 18, "totalReviews": 323, "uuid": "0b3cb605-3eb5-47f4-ab5d-784570a7bf46", "image": "https://images-na.ssl-images-amazon.com/images/I/31bZw-1mOCL._AC_.jpg", "variations": {"sizes": [], "colors": ["Grey", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3LRDQCJ73A2H4&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B00357YS3A", "isPrime": "false", "url": "https://www.amazon.com/dp/B00357YS3A", "title": "Breville the Compact Smart Oven, Countertop Electric Toaster Oven BOV650XL", "price": 359.0, "category": "Home & Kitchen", "bsr": 6134, "soldByAmazon": "false", "rating": 4.5, "isFba": "false", "aboutBullets": ["Smart element IQ: There's heat, and there's smart heat; Element IQ transfers heat intelligently across 4 quartz elements for accurate and stable heat just where and when you want it for perfect results, every time", "8 cooking functions: 8 cooking functions to guide you to perfection: Toast, bagel, bake, roast, broil, pizza, cookies and reheat", "All the room for delicious you're looking for: 4 Slice Toaster, 12 inches Pizza, 6 cup muffin tray, roast chicken and anything else you've got for it", "Backlit easy read LCD: Calculates correct time and temperature, Illuminating orange during preheating and cooking, and blue once cycle is complete", "Non stick cavity coasting: The walls on the inside of the oven feature a non-stick coating for easy cleaning", "Capacity: 4 slice toaster oven, 12 inch pizza"], "description": "The Compact Smart Oven with Element IQ includes most of the features of a larger Smart Oven in a compact, counter space saving design. From toast for breakfast, open melt for lunch to roasting for dinner, you can use it throughout your day.", "hasBuyBox": "false", "soldBy": "Stark-Deals", "sellers": 2, "totalReviews": 3095, "uuid": "ed1063c8-0fa4-47a5-baa0-10d449675603", "image": "https://images-na.ssl-images-amazon.com/images/I/41AU85%2BnMFL._AC_.jpg", "variations": null, "soldByStoreLink": "https://www.amazon.com/s?me=A2U8F1F13X6I1V&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"}
][
{"asin": "B07S864GPW", "isPrime": "false", "url": "https://www.amazon.com/dp/B07S864GPW", "title": "Shark IQ Robot Self-Empty XL RV1001AE, Robotic Vacuum, IQ Navigation, Home Mapping, Self-Cleaning Brushroll, Wi-Fi Connected, Works with Alexa", "price": 484.0, "category": "Home & Kitchen", "bsr": 514, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["FORGET ABOUT VACUUMING FOR UP TO A MONTH: A bagless, self-emptying base holds up to 30 days of dirt and debris.", "POWERFUL SUCTION: Deep-cleaning power to take on large debris, small debris, and pet hair on carpets & floors.", "NO HAIR WRAP: Self-cleaning brushroll removes pet hair and long hair as it cleans - no more hair wrap.", "PHONE OR VOICE COMMAND: Schedule whole-home cleanings or target specific rooms or areas to clean right now with the SharkClean app or voice control with Amazon Alexa or Google Assistant.", "TOTAL HOME MAPPING + ROOM SELECT: Maps your home and lets you choose which rooms to clean right now.", "ROW-BY-ROW CLEANING: Methodically cleans row by row and then navigates room to room for complete home coverage.", "RECHARGE AND RESUME: The Shark IQ Robot vacuum will return to the dock, recharge, and can pick up where it left off."], "description": "Forget about vacuuming for up to a month. The Shark IQ Robot Self-Empty XL combines the convenience of a self-empty base + IQ Navigation total home mapping for complete, efficient cleaning with the performance of Shark suction and self-cleaning brushroll. After each cleaning session, your robot vacuum automatically empties into the bagless base, which holds up to a month of dirt and debris.", "hasBuyBox": "true", "soldBy": "Tech & Beyond", "sellers": 39, "totalReviews": 4835, "uuid": "c00af02d-c0cb-4667-b47c-fd6d78eb7f1f", "image": "https://images-na.ssl-images-amazon.com/images/I/41oBMbWe4eL._AC_.jpg", "variations": {"sizes": [], "colors": ["Works With Alexa"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A10T40VDKH3AJB&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B0147WIC7E", "isPrime": "false", "url": "https://www.amazon.com/dp/B0147WIC7E", "title": "Office Chair Ergonomic Desk Chair Mesh Computer Chair Lumbar Support Modern Executive Adjustable Stool Rolling Swivel Chair for Back Pain, Black", "price": 39.0, "category": "Home & Kitchen", "bsr": 569, "soldByAmazon": "false", "rating": 4.2, "isFba": "false", "aboutBullets": ["BUILT FOR COMFORT - Our mesh office/computer chair is built for long-lasting comfort. And easily adjusted for height, the locking mechanism keeps the back upright and relieves the stress and pain brought on by other office chairs.", "ERGONOMIC DESIGN - Designed with human-oriented ergonomic construction, users have full mobility whether you're gaming, working on the computer, or meeting in the office.", "BIFIMA QUALITY-CERTIFIED - Our chairs pass all components of the BIFIMA certification, and are a reliable and sturdy option for users weighing up to 250 pounds.", "EASY ASSEMBLY - Our chair comes ready to assemble, with all the hardware and necessary tools. With step-by-step instructions, you'll be set up and ready to game, take on the office in about 10-15 minutes!", "CUSTOMER GUARANTEE - We want all of our customers to feel ready to take on the day from the comfort of our chairs. This chair comes with 90-days warranty, and a 100% satisfaction guarantee, but if you're not satisfied, please contact BestOffice customer service."], "description": "", "hasBuyBox": "true", "soldBy": "BestForLess Store", "sellers": 4, "totalReviews": 20701, "uuid": "fd8e96fe-0962-4e01-abd3-7a86dac0b9b1", "image": "https://images-na.ssl-images-amazon.com/images/I/41t8zBINMoL._AC_.jpg", "variations": {"sizes": [], "colors": ["Black", "Blue", "Green", "Grey", "Orange", "Pink", "Red", "White"], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A1QHS1XNTA0I67&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
{"asin": "B07PC7MHQ8", "isPrime": "false", "url": "https://www.amazon.com/dp/B07PC7MHQ8", "title": "Keurig K-Duo Coffee Maker, Single Serve and 12-Cup Carafe Drip Coffee Brewer, Compatible with K-Cup Pods and Ground Coffee, Black", "price": 115.0, "category": "Home & Kitchen", "bsr": 473, "soldByAmazon": "false", "rating": 4.4, "isFba": "false", "aboutBullets": ["What's in the box: 12-cup glass carafe included with your brewer along with a heating plate to keep coffee hot.", "Brew a cup and a carafe: Use both ground coffee and k-cup pods. Height with handle open-17.63 H inch. Height with drip cover open-18 H inch", "Multiple brew sizes: Brew a 6, 8, 10, or 12-cup carafe and a 6, 8, 10, or 12 ounce cup.", "Compatible with keurig gold tone mesh filter accessory: A reusable coffee filter you can use to brew your perfect carafe (sold separately).", "Large 60 ounce water reservoir: The 60 ounce water reservoir is shared between the single serve and carafe brewing, saving you time and simplifying your morning routine. Removable reservoir makes refilling easy.", "Strong brew: Brew a stronger, more intense single cup. 30 inch cord length", "Programmable carafe auto-brew: Program your coffee maker to automatically brew a carafe upto 24 hours in advance."], "description": "Introducing the K-Duo Single Serve and Carafe Coffee Maker: the perfect brewer for any occasion. This versatile brewer is the best of both worlds, using both K-Cup pods and ground coffee to brew a cup and a carafe of your favorite varieties. The included 12-cup glass carafe and heating plate are perfect for keeping your coffee hot, and the added convenience of the Pause and Pour feature makes serving a snap! No need to wait for the entire carafe to brew - the Keurig K-Duo coffee maker can be paused mid-brew for 20 seconds, so you can pour fresh, hot coffee right away. Or set your preferred brew time up to 24 hours in advance and enjoy a freshly brewed carafe right when you want it with Programmable Carafe Auto Brew. Create your perfect cup and carafe every time with the K-Duo coffee maker. Choose your favorite ground coffee, or choose from hundreds of delicious K-Cup pod varieties of coffee, tea, cocoa, and more. Use the Strong Brew button for a bolder, more intense single cup. With multiple brew sizes, you can make a 6, 8, 10, or 12-cup carafe for large gatherings, as well as a 6, 8, 10, or 12 oz cup just for you. You can brew the perfect amount of fresh, full-flavored coffee whether you're hosting friends or just enjoying a cup - and a moment - to yourself!", "hasBuyBox": "false", "soldBy": "DealStop", "sellers": 31, "totalReviews": 4949, "uuid": "05f8d94a-f1ba-486b-a6b8-1a7c8ef8fbb0", "image": "https://images-na.ssl-images-amazon.com/images/I/41h7Iqa0NcL._AC_.jpg", "variations": {"sizes": [], "colors": [], "patter_name": [], "style_name": []}, "soldByStoreLink": "https://www.amazon.com/s?me=A3JCHGC39OT7LA&marketplaceID=ATVPDKIKX0DER", "isSellerNameInProductName": "false"},
